Repository: DigitalVillage-TIET/Digi-Portal
Catalog: digivi/locale/*/LC_MESSAGES/django.po
Languages: pa

source: Ignoring pests completely
pa: ਕੀੜਿਆਂ ਨੂੰ ਪੂਰੀ ਤਰ੍ਹਾਂ ਅਣਡਿੱਠਾ ਕਰਨਾ

source: Using only chemical controls
pa: ਸਿਰਫ਼ ਰਸਾਇਣਕ ਤਰੀਕੇ ਵਰਤਣਾ

source: Farm Story: From Land to Irrigation
pa: ਖੇਤ ਦੀ ਕਹਾਣੀ: ਜ਼ਮੀਨ ਤੋਂ ਸਿੰਚਾਈ ਤੱਕ

source: Farm Overview
pa: ਖੇਤ ਦਾ ਸਰਵੇਖਣ

source: A farm is a piece of land with its own irrigation source, managed by an owner or leaseholder. Each farm is divided into several adjacent soil plots (1–2 acres each) separated by small soil barriers. Plot positions are changed seasonally to adapt to conditions and maximize yields. Different crops or rice cultivation methods may be used on different plots within the same farm, but most farms grow only rice during Kharif. Land can be owned, leased, or a mix, with rare cases of government (Panchayat) leasing via auction.
pa: ਖੇਤ ਇੱਕ ਜ਼ਮੀਨ ਦਾ ਟੁਕੜਾ ਹੁੰਦਾ ਹੈ ਜਿਸਦਾ ਆਪਣਾ ਸਿੰਚਾਈ ਸਰੋਤ ਹੁੰਦਾ ਹੈ ਅਤੇ ਇਸਨੂੰ ਮਾਲਕ ਜਾਂ ਪੱਟੇਦਾਰ ਚਲਾਉਂਦੇ ਹਨ। ਹਰ ਖੇਤ ਨੂੰ ਛੋਟੇ-ਛੋਟੇ ਟੁਕੜਿਆਂ (1–2 ਏਕੜ) ਵਿੱਚ ਵੰਡਿਆ ਜਾਂਦਾ ਹੈ, ਜੋ ਮਿੱਟੀ ਦੀਆਂ ਛੋਟੀਆਂ ਕੰਧਾਂ ਨਾਲ ਵੱਖਰੇ ਹੁੰਦੇ ਹਨ। ਟੁਕੜਿਆਂ ਦੀ ਸਥਿਤੀ ਹਰੇਕ ਮੌਸਮ ਵਿੱਚ ਬਦਲੀ ਜਾਂਦੀ ਹੈ ਤਾਂ ਜੋ ਹਾਲਾਤਾਂ ਅਨੁਸਾਰ ਫਸਲ ਵਧੀਆ ਹੋਵੇ। ਵੱਖ-ਵੱਖ ਟੁਕੜਿਆਂ 'ਤੇ ਵੱਖ-ਵੱਖ ਫਸਲਾਂ ਜਾਂ ਚੌਲ ਦੀਆਂ ਤਕਨੀਕਾਂ ਵਰਤੀ ਜਾਂਦੀਆਂ ਹਨ, ਪਰ ਜ਼ਿਆਦਾਤਰ ਖੇਤਾਂ ਵਿੱਚ ਖਰੀਫ਼ ਦੌਰਾਨ ਸਿਰਫ਼ ਚੌਲ ਹੀ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ਜ਼ਮੀਨ ਮਾਲਕੀ, ਪੱਟੇ ਜਾਂ ਦੋਹਾਂ ਦਾ ਮਿਲਾਪ ਹੋ ਸਕਦੀ ਹੈ, ਸਰਕਾਰ (ਪੰਚਾਇਤ) ਵੱਲੋਂ ਪੱਟੇ ਤੇ ਦੇਣ ਦੇ ਮਾਮਲੇ ਵੱਡੇ ਹੀ ਘੱਟ ਹਨ।

source: Farmer
pa: ਕਿਸਾਨ

source: The main farmer (owner or leaseholder) manages all cultivation activities, including irrigation, inputs, sowing, and harvest. Most farms are family-owned, but some larger farms are jointly run, often by brothers. Farmers may own multiple farms, with land titles typically in their name or a close relative’s. Only land owners qualify for government subsidies. Tenant farmers lease land formally or informally; many are also land owners expanding their operations through additional leased land.
pa: ਮੁੱਖ ਕਿਸਾਨ (ਮਾਲਕ ਜਾਂ ਪੱਟੇਦਾਰ) ਸਾਰੇ ਖੇਤੀ ਕੰਮਾਂ ਦੀ ਦੇਖਭਾਲ ਕਰਦਾ ਹੈ, ਜਿਸ ਵਿੱਚ ਸਿੰਚਾਈ, ਖਾਦ, ਬਿਜਾਈ ਅਤੇ ਕਟਾਈ ਸ਼ਾਮਲ ਹਨ। ਜ਼ਿਆਦਾਤਰ ਖੇਤ ਪਰਿਵਾਰਕ ਮਾਲਕੀ ਵਾਲੇ ਹਨ, ਪਰ ਕੁਝ ਵੱਡੇ ਖੇਤ ਭਰਾਵਾਂ ਵੱਲੋਂ ਮਿਲ ਕੇ ਚਲਾਏ ਜਾਂਦੇ ਹਨ। ਕਿਸਾਨ ਕਈ ਖੇਤਾਂ ਦੇ ਮਾਲਕ ਹੋ ਸਕਦੇ ਹਨ, ਜ਼ਮੀਨ ਆਮ ਤੌਰ 'ਤੇ ਉਨ੍ਹਾਂ ਜਾਂ ਉਨ੍ਹਾਂ ਦੇ ਨੇੜਲੇ ਰਿਸ਼ਤੇਦਾਰ ਦੇ ਨਾਂ ਹੋਂਦੀ ਹੈ। ਸਿਰਫ਼ ਮਾਲਕਾਂ ਨੂੰ ਹੀ ਸਰਕਾਰੀ ਸਬਸਿਡੀ ਮਿਲਦੀ ਹੈ। ਪੱਟੇਦਾਰ ਕਿਸਾਨ ਜ਼ਮੀਨ ਨੂੰ ਰਸਮੀ ਜਾਂ ਗੈਰ-ਰਸਮੀ ਤਰੀਕੇ ਨਾਲ ਲੈਂਦੇ ਹਨ; ਬਹੁਤ ਸਾਰੇ ਪੱਟੇਦਾਰ ਆਪਣੇ ਖੇਤ ਵੀ ਰੱਖਦੇ ਹਨ ਅਤੇ ਵਾਧੂ ਪੱਟੇ ਰਾਹੀਂ ਆਪਣਾ ਕਾਰੋਬਾਰ ਵਧਾਉਂਦੇ ਹਨ।

source: Irrigation
pa: ਸਿੰਚਾਈ

source: Most farms have exclusive tube-well excavated and operated within its land. Some farms share tube-wells with other farmers. But mostly it is exclusively used by the farm. Canal - It is used based on its availability, and the government controls it through upstream valves. Mostly it is applied into the farm through government-sponsored underground pipelines. Occasionally opportunistic farmers with plots adjacent to the canal will use diesel-based portable pumps to irrigate into their land.
pa: ਜ਼ਿਆਦਾਤਰ ਖੇਤਾਂ ਵਿੱਚ ਆਪਣਾ ਟਿਊਬਵੈਲ ਹੁੰਦਾ ਹੈ ਜੋ ਉਨ੍ਹਾਂ ਦੀ ਜ਼ਮੀਨ ਵਿੱਚ ਹੀ ਖੋਦਿਆ ਜਾਂਦਾ ਹੈ। ਕੁਝ ਖੇਤ ਟਿਊਬਵੈਲ ਹੋਰ ਕਿਸਾਨਾਂ ਨਾਲ ਸਾਂਝੇ ਕਰਦੇ ਹਨ, ਪਰ ਆਮ ਤੌਰ 'ਤੇ ਇਹ ਖੇਤ ਦੀ ਆਪਣੀ ਵਰਤੋਂ ਲਈ ਹੁੰਦਾ ਹੈ। ਨਹਿਰ - ਇਹ ਉਪਲਬਧਤਾ ਅਨੁਸਾਰ ਵਰਤੀ ਜਾਂਦੀ ਹੈ ਅਤੇ ਸਰਕਾਰ ਇਸਨੂੰ ਉਪਰਲੇ ਵੈਲਵਾਂ ਰਾਹੀਂ ਕੰਟਰੋਲ ਕਰਦੀ ਹੈ। ਆਮ ਤੌਰ 'ਤੇ ਇਹ ਸਰਕਾਰੀ ਸਹਾਇਤਾ ਨਾਲ ਬਣੀਆਂ ਅੰਡਰਗਰਾਊਂਡ ਪਾਈਪਲਾਈਨਾਂ ਰਾਹੀਂ ਖੇਤ ਵਿੱਚ ਪਹੁੰਚਾਈ ਜਾਂਦੀ ਹੈ। ਕਈ ਵਾਰੀ, ਜਿਨ੍ਹਾਂ ਦੇ ਪਲਾਟ ਨਹਿਰ ਦੇ ਨੇੜੇ ਹੁੰਦੇ ਹਨ, ਉਹ ਡੀਜ਼ਲ ਵਾਲੇ ਪੋਰਟੇਬਲ ਪੰਪ ਰਾਹੀਂ ਆਪਣੀ ਜ਼ਮੀਨ ਵਿੱਚ ਸਿੰਚਾਈ ਕਰ ਲੈਂਦੇ ਹਨ।

source: Open-air Canals
pa: ਖੁੱਲ੍ਹੇ ਨਾਲੇ

source: Irrigation water comes from two main sources: groundwater (via tube-wells) and canals (mainly through government-installed underground pipes). Once water reaches the farm, it is usually distributed to plots using small, open-air soil canals that rely on gravity. Farmers control irrigation by opening soil barriers to direct water to specific plots. Water loss from seepage and evaporation is common. Underground piping within farms is rare and mainly used on large farms; even then, some open-air canal use continues.
pa: ਸਿੰਚਾਈ ਲਈ ਪਾਣੀ ਮੁੱਖ ਤੌਰ 'ਤੇ ਦੋ ਸਰੋਤਾਂ ਤੋਂ ਆਉਂਦਾ ਹੈ: ਭੂਜਲ (ਟਿਊਬਵੈਲ ਰਾਹੀਂ) ਅਤੇ ਨਹਿਰਾਂ (ਜੋ ਆਮ ਤੌਰ 'ਤੇ ਸਰਕਾਰੀ ਅੰਡਰਗਰਾਊਂਡ ਪਾਈਪਾਂ ਰਾਹੀਂ ਆਉਂਦੀਆਂ ਹਨ)। ਜਦੋਂ ਪਾਣੀ ਖੇਤ ਵਿੱਚ ਪਹੁੰਚ ਜਾਂਦਾ ਹੈ, ਤਾਂ ਇਹ ਛੋਟੇ-ਛੋਟੇ ਖੁੱਲ੍ਹੇ ਮਿੱਟੀ ਦੇ ਨਾਲਿਆਂ ਰਾਹੀਂ ਟੁਕੜਿਆਂ ਵਿੱਚ ਵੰਡਿਆ ਜਾਂਦਾ ਹੈ, ਜੋ ਗੁਰਤਵਾਕਰਸ਼ਣ 'ਤੇ ਨਿਰਭਰ ਕਰਦੇ ਹਨ। ਕਿਸਾਨ ਮਿੱਟੀ ਦੀਆਂ ਕੰਧਾਂ ਖੋਲ੍ਹ ਕੇ ਪਾਣੀ ਨੂੰ ਚਾਹੀਦੇ ਟੁਕੜੇ ਵੱਲ ਭੇਜਦੇ ਹਨ। ਪਾਣੀ ਦੀ ਰਿਸਾਅ ਅਤੇ ਵਾਸ਼ਪੀਕਰਨ ਕਾਰਨ ਨੁਕਸਾਨ ਆਮ ਹੈ। ਖੇਤਾਂ ਵਿੱਚ ਅੰਡਰਗਰਾਊਂਡ ਪਾਈਪਿੰਗ ਵੱਡੇ ਖੇਤਾਂ ਵਿੱਚ ਹੀ ਹੁੰਦੀ ਹੈ; ਉੱਥੇ ਵੀ ਕੁਝ ਹੱਦ ਤੱਕ ਖੁੱਲ੍ਹੇ ਨਾਲਿਆਂ ਦੀ ਵਰਤੋਂ ਜਾਰੀ ਰਹਿੰਦੀ ਹੈ।

source: Template Selection
pa: ਟੈਂਪਲੇਟ ਚੁਣੋ

source: Back to Home
pa: ਮੁੱਖ ਸਫ਼ੇ ਤੇ ਵਾਪਸ

source: Logout
pa: ਲੌਗਆਊਟ

source: Choose Your Template
pa: ਆਪਣਾ ਟੈਂਪਲੇਟ ਚੁਣੋ

source: Select from our advanced agricultural analysis tools and start optimizing your farming operations with data-driven insights
pa: ਸਾਡੇ ਉੱਨਤ ਖੇਤੀ-বਿਸ਼ਲੇਸ਼ਣ ਸੰਦਾਂ ਵਿੱਚੋਂ ਚੁਣੋ ਅਤੇ ਡੇਟਾ-ਚਲਿਤ ਜਾਣਕਾਰੀ ਨਾਲ ਆਪਣੇ ਖੇਤੀ ਕਾਰਜਾਂ ਨੂੰ ਬਿਹਤਰ ਬਣਾਓ

source: Meter Reading
pa: ਮੀਟਰ ਪੜ੍ਹੋ

source: Advanced sensor data analysis for monitoring water consumption and irrigation efficiency across your agricultural operations.
pa: ਤੁਹਾਡੇ ਖੇਤੀ ਕਾਰਜਾਂ ਵਿੱਚ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਅਤੇ ਸਿਫਾਰਤ ਦੀ ਕਾਰਗੁਜ਼ਾਰੀ ਦੀ ਨਿਗਰਾਨੀ ਲਈ ਉੱਚ ਪੱਧਰੀ ਸੰਵੇਦਕ ਡੇਟਾ ਵਿਸ਼ਲੇਸ਼ਣ।

source: Active
pa: ਕਿਰਿਆਸ਼ੀਲ

source: Water Level Dashboard
pa: ਪਾਣੀ ਦੀ ਸਤਰ ਡੈਸ਼ਬੋਰਡ

source: Real-time water level monitoring and predictive analytics for optimal irrigation management and water conservation.
pa: ਵੱਖ-ਵੱਖ ਖੇਤਾਂ ਦੇ ਪਾਣੀ ਦੀ ਸਤਰ ਦੀ ਰੀਅਲ टाइम ਨਿਗਰਾਨੀ ਅਤੇ ਭਵਿੱਖ ਦੀ ਭਵਿੱਖਬਾਣੀ ਨਾਲ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਖੇਤੀ-ਸਿੰਚਾਈ ਅਤੇ ਸੰਰੱਖਣ।

source: Farmer Survey
pa: ਕਿਸਾਨ ਸਰਵੇਖਣ

source: Comprehensive survey analysis tools for gathering and processing farmer feedback, crop performance, and field conditions.
pa: ਕਿਸਾਨਾਂ ਦੀ ਪ੍ਰਤਿਕ੍ਰਿਆ, ਫਸਲ ਦੇ ਨਤੀਜੇ ਅਤੇ ਖੇਤ ਦੀ ਹਾਲਤ ਇਕੱਤਰ ਕਰਨ ਅਤੇ ਸਫਾਈ ਕਰਨ ਲਈ ਵਿਸਤ੍ਰਿਤ ਸਰਵੇਖਣ ਵਿਸ਼ਲੇਸ਼ਣ ਸੰਦ।

source: Evapotranspiration
pa: ਵਿਅਪੋਟ੍ਰਾਂਸਪਿਰੇਸ਼ਨ

source: Calculate crop water requirements using advanced ET models, weather data, and soil moisture analytics for precision irrigation.
pa: ਖੇਤੀ ਲਈ ਜਰੂਰੀ ਪਾਣੀ ਦੀ ਮਾਤਰਾ ਨਿਰਧਾਰਤ ਕਰਨ ਲਈ ਉੱਨਤ ET ਮਾਡਲ, ਮੌਸਮੀ ਡੇਟਾ ਅਤੇ ਮਿੱਟੀ ਦੀ ਨਮੀ ਵਿਸ਼ਲੇਸ਼ਣ ਦਾ ਉਪਯੋਗ ਕਰਕੇ ਸੁਨੀਸ਼ਚਿਤ ਖੇਤੀ-ਸਿੰਚਾਈ।

source: Field Mapping
pa: ਖੇਤ ਨਕਸ਼ਾ

source: Advanced GIS tools for field boundary mapping, crop monitoring, and spatial analysis of agricultural data and satellite imagery.
pa: ਖੇਤ ਸੀਮਾ ਨਕਸ਼ੇ ਬਣਾਉਣ, ਫਸਲ ਨਿਗਰਾਨੀ ਅਤੇ ਖੇਤੀ ਵਾਲੇ ਡੇਟਾ ਤੇ ਸੈਟੈਲਾਈਟ ਤਸਵੀਰਾਂ ਦੀ ਅਸਥਾਈ ਵਿਸ਼ਲੇਸ਼ਣ ਲਈ ਅਧੁਨਿਕ GIS ਸੰਦ।

source: Need help getting started? Our technical team is here to assist you.
pa: ਸ਼ੁਰੂਆਤ ਵਿੱਚ ਮਦਦ ਚਾਹੀਦੀ ਹੈ? ਸਾਡੀ ਟੈਕਨੀਕੀ ਟੀਮ ਤੁਹਾਡੀ ਮਦਦ ਲਈ ਉਪਲਬਧ ਹੈ।

source: Upload correct file formats
pa: ਸਹੀ ਫਾਇਲ ਫਾਰਮੈਟ ਅਪਲੋਡ ਕਰੋ

source: Contact Digi-Village Tech Team
pa: ਡਿਜੀ-ਵਿਲੇਜ਼ ਟੈਕ ਟੀਮ ਨਾਲ ਸੰਪਰਕ ਕਰੋ

source: Technical support available
pa: ਤਕਨੀਕੀ ਸਹਾਇਤਾ ਉਪਲਬਧ

source: DIGI-VI | Digital Village Intelligence Platform
pa: ਡਿਜੀ-ਵੀ | ਡਿਜੀਟਲ ਵਿਲੇਜ ਇੰਟੈਲੀਜੈਂਸ ਪਲੇਟਫਾਰਮ

source: Research Studies
pa: ਖੋਜ ਅਧਿਐਨ

source: Knowledge Base
pa: ਗਿਆਨ ਅਧਾਰ

source: Team
pa: ਟੀਮ

source: Member Access
pa: ਮੈਂਬਰ ਐਕਸੈਸ

source: Developers
pa: ਡਿਵੈਲਪਰ

source: WATER SAVING RESEARCH STUDIES
pa: ਪਾਣੀ ਬਚਾਉਣ ਵਾਲੇ ਖੋਜ ਅਧਿਐਨ

source: Digital Village Project
pa: ਡਿਜੀਟਲ ਵਿਲੇਜ ਪਰੋਜੈਕਟ

source: This is a research study conducted by the Thapar Institute of Engineering and Technology in Patiala and Tel-Aviv University from Israel. This study aims to understand the challenges faced by farmers in Punjab, particularly in the areas of irrigation, crop cultivation, and livelihoods. The information gathered from the farmers will help us identify practical solutions to improve farmer incomes and promote water-saving methods for irrigation.
pa: ਇਹ ਖੋਜ ਅਧਿਐਨ ਥਾਪਰ ਇੰਸਟੀਚਿਊਟ ਆਫ ਇੰਜੀਨੀਅਰਿੰਗ ਐਂਡ ਟੈਕਨੋਲੋਜੀ, ਪਟਿਆਲਾ ਅਤੇ ਟੈਲ-ਅਵੀਵ ਯੂਨੀਵਰਸਿਟੀ, ਇਜ਼ਰਾਈਲ ਵੱਲੋਂ ਕੀਤਾ ਗਿਆ ਹੈ। ਇਸ ਅਧਿਐਨ ਦਾ ਉਦੇਸ਼ ਪੰਜਾਬ ਦੇ ਕਿਸਾਨਾਂ ਨੂੰ ਆ ਰਹੀਆਂ ਮੁਸ਼ਕਲਾਂ ਨੂੰ ਸਮਝਣਾ ਹੈ, ਖਾਸ ਕਰਕੇ ਸਿੰਚਾਈ, ਫਸਲ ਉਗਾਈ ਅਤੇ ਜੀਵਨ-ਜੀਵਿਕਾ ਵਿੱਚ। ਕਿਸਾਨਾਂ ਤੋਂ ਇਕੱਠੀ ਕੀਤੀ ਜਾਣਕਾਰੀ ਸਾਨੂੰ ਕਿਸਾਨਾਂ ਦੀ ਆਮਦਨ ਵਧਾਉਣ ਅਤੇ ਸਿੰਚਾਈ ਲਈ ਪਾਣੀ-ਬਚਾਉਣ ਵਾਲੇ ਤਰੀਕਿਆਂ ਨੂੰ ਉਤਸ਼ਾਹਿਤ ਕਰਨ ਲਈ ਵਿਹਾਰਕ ਹੱਲ ਲੱਭਣ ਵਿੱਚ ਮਦਦ ਕਰੇਗੀ।

source: These studies are funded by TIET-TAU Center of Excellence for Food Security (T2CEFS) and International Growth Center (IGC) from UK.
pa: ਇਹ ਅਧਿਐਨ TIET-TAU ਫੂਡ ਸੁਰੱਖਿਆ ਲਈ ਸੈਂਟਰ ਆਫ ਐਕਸੀਲੈਂਸ (T2CEFS) ਅਤੇ ਯੂਕੇ ਦੇ ਇੰਟਰਨੈਸ਼ਨਲ ਗ੍ਰੋਥ ਸੈਂਟਰ (IGC) ਵੱਲੋਂ ਵਿੱਤੀ ਸਹਾਇਤਾ ਪ੍ਰਾਪਤ ਹਨ।

source: Explore Platform
pa: ਪਲੇਟਫਾਰਮ ਵੇਖੋ

source: Meet the Team
pa: ਟੀਮ ਨੂੰ ਮਿਲੋ

source: Explore our latest research and innovations
pa: ਸਾਡੀ ਨਵੀਨਤਮ ਖੋਜ ਅਤੇ ਨਵੀਨਤਾ ਵੇਖੋ

source: Alternate Wetting Drying (AWD)
pa: ਬਦਲਵੇਂ ਢੰਗ ਨਾਲ ਗਿੱਲਾ ਕਰਨਾ ਅਤੇ ਸੁਕਾਉਣਾ (AWD)

source: Efficient water-saving irrigation technique for rice cultivation.
pa: ਚੌਲ ਦੀ ਖੇਤੀ ਲਈ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਪਾਣੀ-ਬਚਾਉਣ ਵਾਲੀ ਸਿੰਚਾਈ ਤਕਨੀਕ।

source: Learn More
pa: ਹੋਰ ਜਾਣੋ

source: Remote Controllers
pa: ਰਿਮੋਟ ਕੰਟਰੋਲਰ

source: Remote controllers for irrigation and farm systems.
pa: ਸਿੰਚਾਈ ਅਤੇ ਖੇਤ ਪ੍ਰਣਾਲੀ ਲਈ IoT-ਅਧਾਰਤ ਰਿਮੋਟ ਕੰਟਰੋਲ।

source: Direct Seeded Rice (DSR)
pa: ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR)

source: Innovative rice planting method for water saving.
pa: ਪਾਣੀ ਬਚਾਉਣ ਲਈ ਨਵੀਨਤਮ ਚੌਲ ਬੀਜਣ ਤਰੀਕਾ।

source: Water Metering
pa: ਪਾਣੀ ਮਾਪਣਾ

source: Real-time water usage monitoring and analytics.
pa: ਰੀਅਲ-ਟਾਈਮ ਪਾਣੀ ਵਰਤੋਂ ਦੀ ਨਿਗਰਾਨੀ ਅਤੇ ਵਿਸ਼ਲੇਸ਼ਣ।

source: Water Level Monitoring
pa: ਪਾਣੀ ਦੀ ਸਤਰ ਨਿਗਰਾਨੀ

source: Continuous monitoring of field water levels.
pa: ਖੇਤ ਵਿੱਚ ਪਾਣੀ ਦੀ ਸਤਰ ਦੀ ਲਗਾਤਾਰ ਨਿਗਰਾਨੀ।

source: Remote Sensing
pa: ਰਿਮੋਟ ਸੈਂਸਿੰਗ

source: Satellite-based agricultural monitoring.
pa: ਸੈਟੈਲਾਈਟ ਅਤੇ ਡਰੋਨ-ਅਧਾਰਤ ਖੇਤੀ ਨਿਗਰਾਨੀ।

source: Close modal
pa: ਬੰਦ ਕਰੋ

source: Rice is a major crop in Punjab, particularly during the Kharif season, where traditional transplanting methods (TPR) are commonly used. These methods require large quantities of water, typically sourced from groundwater via subsidized electric tubewells, leading to severe aquifer depletion. The transplanted paddy system demands continuous field flooding, especially during the early vegetative and flowering stages, making rice farming highly water-intensive and increasingly unsustainable. Compounding the issue, traditional rice cultivation is also a major contributor to methane emissions, accounting for around 12%% of global methane output.
pa: ਚੌਲ ਪੰਜਾਬ ਦੀ ਮੁੱਖ ਫਸਲ ਹੈ, ਖਾਸ ਕਰਕੇ ਖਰੀਫ਼ ਮੌਸਮ ਵਿੱਚ, ਜਿੱਥੇ ਰਵਾਇਤੀ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਤਰੀਕੇ (TPR) ਆਮ ਹਨ। ਇਹ ਤਰੀਕੇ ਵੱਡੀ ਮਾਤਰਾ ਵਿੱਚ ਪਾਣੀ ਦੀ ਲੋੜ ਕਰਦੇ ਹਨ, ਜੋ ਆਮ ਤੌਰ 'ਤੇ ਸਬਸਿਡੀ ਵਾਲੇ ਬਿਜਲੀ ਟਿਊਬਵੈਲ ਰਾਹੀਂ ਭੂਜਲ ਤੋਂ ਲਿਆ ਜਾਂਦਾ ਹੈ, ਜਿਸ ਨਾਲ ਭੂਜਲ ਸਰੋਤ ਘੱਟਦੇ ਹਨ। ਟ੍ਰਾਂਸਪਲਾਂਟਡ ਚੌਲ ਪ੍ਰਣਾਲੀ ਲਗਾਤਾਰ ਖੇਤ ਵਿੱਚ ਪਾਣੀ ਭਰਨ ਦੀ ਮੰਗ ਕਰਦੀ ਹੈ, ਖਾਸ ਕਰਕੇ ਸ਼ੁਰੂਆਤੀ ਵਾਧੂ ਅਤੇ ਫੁੱਲਣ ਦੇ ਪੜਾਅ ਵਿੱਚ, ਜਿਸ ਨਾਲ ਚੌਲ ਦੀ ਖੇਤੀ ਬਹੁਤ ਪਾਣੀ-ਵਧੀਕ ਅਤੇ ਅਸਥਿਰ ਬਣ ਜਾਂਦੀ ਹੈ। ਇਸਦੇ ਨਾਲ, ਰਵਾਇਤੀ ਚੌਲ ਖੇਤੀ ਮੀਥੇਨ ਗੈਸ ਦੇ ਨਿਕਾਸ ਵਿੱਚ ਵੀ ਵੱਡਾ ਯੋਗਦਾਨ ਪਾਉਂਦੀ ਹੈ, ਜੋ ਦੁਨੀਆ ਦੇ ਲਗਭਗ 12%% ਮੀਥੇਨ ਨਿਕਾਸ ਲਈ ਜ਼ਿੰਮੇਵਾਰ ਹੈ।

source: AWD field technician
pa: AWD ਖੇਤ ਤਕਨੀਕੀ

source: A field technician demonstrating AWD pipes during rice cultivation in Punjab.
pa: ਪੰਜਾਬ ਵਿੱਚ ਚੌਲ ਦੀ ਖੇਤੀ ਦੌਰਾਨ AWD ਪਾਈਪਾਂ ਦਾ ਡੈਮੋ ਦਿੰਦਾ ਖੇਤ ਤਕਨੀਕੀ।

source: AWD field close-up
pa: AWD ਖੇਤ ਨਜ਼ਦੀਕੀ

source: Close-up view of AWD irrigation setup in the field.
pa: ਖੇਤ ਵਿੱਚ AWD ਸਿੰਚਾਈ ਸੈਟਅੱਪ ਦਾ ਨਜ਼ਦੀਕੀ ਦ੍ਰਿਸ਼।

source: Detailed Explanation of the Research
pa: ਖੋਜ ਦੀ ਵਿਸਥਾਰ ਪੂਰਵਕ ਵਿਆਖਿਆ

source: In response, the Punjab government has introduced cash incentives to promote water-saving techniques like Direct Seeding of Rice (DSR) and micro-irrigation systems such as drip irrigation, though their adoption remains limited. As a more practical solution, researchers and institutions like the International Rice Research Institute (IRRI) advocate for modifying traditional practices through methods like Alternate Wetting and Drying (AWD).
pa: ਇਸਦੇ ਜਵਾਬ ਵਿੱਚ, ਪੰਜਾਬ ਸਰਕਾਰ ਨੇ ਪਾਣੀ-ਬਚਾਉਣ ਵਾਲੀਆਂ ਤਕਨੀਕਾਂ ਜਿਵੇਂ ਡਾਇਰੈਕਟ ਸੀਡਿੰਗ ਆਫ ਰਾਈਸ (DSR) ਅਤੇ ਮਾਈਕ੍ਰੋ-ਇਰੀਗੇਸ਼ਨ ਪ੍ਰਣਾਲੀਆਂ (ਜਿਵੇਂ ਡ੍ਰਿਪ ਸਿੰਚਾਈ) ਨੂੰ ਉਤਸ਼ਾਹਿਤ ਕਰਨ ਲਈ ਨਕਦੀ ਪ੍ਰੋਤਸਾਹਨ ਸ਼ੁਰੂ ਕੀਤੇ ਹਨ, ਹਾਲਾਂਕਿ ਇਹਨਾਂ ਦੀ ਅਪਣਾਈ ਹਾਲੇ ਵੀ ਘੱਟ ਹੈ। ਹੋਰ ਵਿਹਾਰਕ ਹੱਲ ਵਜੋਂ, ਖੋਜਕਾਰ ਅਤੇ ਸੰਸਥਾਵਾਂ (ਜਿਵੇਂ ਇੰਟਰਨੈਸ਼ਨਲ ਰਾਈਸ ਰਿਸਰਚ ਇੰਸਟੀਚਿਊਟ - IRRI) ਬਦਲਵੇਂ ਢੰਗ ਨਾਲ ਗਿੱਲਾ ਕਰਨਾ ਅਤੇ ਸੁਕਾਉਣਾ (AWD) ਵਰਗੀਆਂ ਤਕਨੀਕਾਂ ਰਾਹੀਂ ਬਦਲਣ ਦੀ ਸਿਫਾਰਸ਼ ਕਰਦੇ ਹਨ।

source: Under AWD, instead of maintaining continuous flooding, farmers allow water levels to recede up to 5 cm below the soil before re-flooding to a shallow level, repeating this cycle during critical growth stages. This approach can significantly reduce water usage without sacrificing yields. The proposed study aims to evaluate whether payment-for-ecosystem-services (PES) incentives can effectively promote AWD adoption and quantify the actual water savings achieved by participating farmers.
pa: AWD ਤਹਿਤ, ਲਗਾਤਾਰ ਪਾਣੀ ਭਰਨ ਦੀ ਬਜਾਏ, ਕਿਸਾਨ ਮਿੱਟੀ ਤੋਂ 5 ਸੈਂਟੀਮੀਟਰ ਹੇਠਾਂ ਪਾਣੀ ਦੀ ਸਤਰ ਆਉਣ ਦਿੰਦੇ ਹਨ, ਫਿਰ ਮੁੜ ਥੋੜ੍ਹਾ ਪਾਣੀ ਭਰਦੇ ਹਨ, ਅਤੇ ਇਹ ਚੱਕਰ ਮਹੱਤਵਪੂਰਨ ਵਾਧੂ ਪੜਾਅ ਵਿੱਚ ਦੁਹਰਾਇਆ ਜਾਂਦਾ ਹੈ। ਇਹ ਤਰੀਕਾ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਨੂੰ ਬਿਨਾਂ ਪੈਦਾਵਾਰ ਘਟਾਏ ਕਾਫੀ ਘਟਾ ਸਕਦਾ ਹੈ। ਇਹ ਅਧਿਐਨ ਵੇਖੇਗਾ ਕਿ PES (payment-for-ecosystem-services) ਪ੍ਰੋਤਸਾਹਨ AWD ਅਪਣਾਉਣ ਨੂੰ ਕਿੰਨਾ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਬਣਾਉਂਦੇ ਹਨ ਅਤੇ ਅਸਲ ਪਾਣੀ-ਬਚਤ ਦੀ ਮਾਪ ਕਰੇਗਾ।

source: In Punjab, rice farming heavily depends on groundwater accessed via submersible pumps powered by state-subsidized electricity. However, the unpredictable 8-hour electricity schedule often forces farmers to keep pumps running continuously, especially during nighttime or rainy conditions, leading to over-irrigation and excessive groundwater extraction. Since there's no direct cost associated with water or electricity, there's little incentive for farmers to limit usage, despite the long-term threat to water sustainability.
pa: ਪੰਜਾਬ ਵਿੱਚ ਚੌਲ ਦੀ ਖੇਤੀ ਮੁੱਖ ਤੌਰ 'ਤੇ ਭੂਜਲ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ, ਜੋ ਕਿ ਸੂਬਾ-ਸਬਸਿਡੀ ਵਾਲੀ ਬਿਜਲੀ ਨਾਲ ਚਲਣ ਵਾਲੇ ਸਬਮਰਸਿਬਲ ਪੰਪਾਂ ਰਾਹੀਂ ਲਿਆ ਜਾਂਦਾ ਹੈ। ਪਰ, ਅਨੁਮਾਨਿਤ 8-ਘੰਟੇ ਬਿਜਲੀ ਸ਼ੈਡਿਊਲ ਕਰਕੇ ਕਿਸਾਨਾਂ ਨੂੰ ਪੰਪ ਲਗਾਤਾਰ ਚਲਾਉਣੇ ਪੈਂਦੇ ਹਨ, ਖਾਸ ਕਰਕੇ ਰਾਤ ਜਾਂ ਮੀਂਹ ਦੌਰਾਨ, ਜਿਸ ਨਾਲ ਵੱਧ ਸਿੰਚਾਈ ਅਤੇ ਭੂਜਲ ਦੀ ਵੱਧ ਖਪਤ ਹੁੰਦੀ ਹੈ। ਕਿਉਂਕਿ ਪਾਣੀ ਜਾਂ ਬਿਜਲੀ ਦੀ ਕੋਈ ਸਿੱਧੀ ਲਾਗਤ ਨਹੀਂ, ਇਸ ਲਈ ਕਿਸਾਨਾਂ ਕੋਲ ਵਰਤੋਂ ਘਟਾਉਣ ਲਈ ਘੱਟ ਪ੍ਰੋਤਸਾਹਨ ਹੁੰਦੇ ਹਨ, ਭਾਵੇਂ ਲੰਬੇ ਸਮੇਂ ਲਈ ਪਾਣੀ ਦੀ ਟਿਕਾਊਤਾ ਨੂੰ ਖਤਰਾ ਹੋਵੇ।

source: Remote controller
pa: ਰਿਮੋਟ ਕੰਟਰੋਲਰ

source: Remote controllers offer a solution by allowing farmers to operate pumps remotely, even during odd hours or adverse weather. These smart systems improve irrigation scheduling, reduce unnecessary power consumption, and enhance convenience by minimizing the need for manual visits. Integrating sensors and automation, they can play a critical role in promoting sustainable water use and boosting farmer satisfaction.
pa: ਰਿਮੋਟ ਕੰਟਰੋਲਰ ਕਿਸਾਨਾਂ ਨੂੰ ਪੰਪ ਦੂਰੋਂ ਚਲਾਉਣ ਦੀ ਸਹੂਲਤ ਦਿੰਦੇ ਹਨ, ਭਾਵੇਂ ਸਮਾਂ ਅਜੀਬ ਹੋਵੇ ਜਾਂ ਮੌਸਮ ਖਰਾਬ ਹੋਵੇ। ਇਹ ਸਮਾਰਟ ਪ੍ਰਣਾਲੀਆਂ ਸਿੰਚਾਈ ਸ਼ੈਡਿਊਲਿੰਗ ਸੁਧਾਰਦੀਆਂ ਹਨ, ਬੇਲੋੜੀ ਬਿਜਲੀ ਦੀ ਵਰਤੋਂ ਘਟਾਉਂਦੀਆਂ ਹਨ ਅਤੇ ਹੱਥੋਂ ਕੰਮ ਕਰਨ ਦੀ ਲੋੜ ਘਟਾ ਕੇ ਸਹੂਲਤ ਵਧਾਉਂਦੀਆਂ ਹਨ। ਸੈਂਸਰ ਅਤੇ ਆਟੋਮੇਸ਼ਨ ਨਾਲ ਮਿਲਾ ਕੇ, ਇਹ ਟਿਕਾਊ ਪਾਣੀ ਵਰਤੋਂ ਅਤੇ ਕਿਸਾਨ ਸੰਤੁਸ਼ਟੀ ਵਧਾਉਣ ਵਿੱਚ ਮਹੱਤਵਪੂਰਨ ਭੂਮਿਕਾ ਨਿਭਾ ਸਕਦੇ ਹਨ।

source: Direct Seeding of Rice (DSR) is an innovative planting method that eliminates the need for transplanting seedlings, saving water and labor while maintaining high yields.
pa: ਡਾਇਰੈਕਟ ਸੀਡਿੰਗ ਆਫ ਰਾਈਸ (DSR) ਇੱਕ ਨਵੀਨਤਮ ਬੀਜਣ ਦਾ ਤਰੀਕਾ ਹੈ ਜੋ ਪੁੱਗੀਆਂ ਟ੍ਰਾਂਸਪਲਾਂਟ ਕਰਨ ਦੀ ਲੋੜ ਖਤਮ ਕਰਦਾ ਹੈ, ਪਾਣੀ ਅਤੇ ਮਜ਼ਦੂਰੀ ਬਚਾਉਂਦਾ ਹੈ ਅਤੇ ਉੱਚ ਪੈਦਾਵਾਰ ਬਣਾਈ ਰੱਖਦਾ ਹੈ।

source: DSR reduces water consumption by avoiding continuous flooding and nursery raising. It shortens the crop cycle and allows timely sowing of subsequent crops. Challenges include weed management and the need for precise field leveling.
pa: DSR ਲਗਾਤਾਰ ਪਾਣੀ ਭਰਨ ਅਤੇ ਨਰਸਰੀ ਉਗਾਉਣ ਤੋਂ ਬਚ ਕੇ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਘਟਾਉਂਦਾ ਹੈ। ਇਹ ਫਸਲ ਚੱਕਰ ਛੋਟਾ ਕਰਦਾ ਹੈ ਅਤੇ ਅਗਲੀ ਫਸਲ ਦੀ ਸਮੇਂ-ਸਿਰ ਬਿਜਾਈ ਯਕੀਨੀ ਬਣਾਉਂਦਾ ਹੈ। ਚੁਣੌਤੀਆਂ ਵਿੱਚ ਘਾਹ-ਨਿਯੰਤਰਣ ਅਤੇ ਖੇਤ ਦੀ ਸਹੀ ਲੈਵਲਿੰਗ ਦੀ ਲੋੜ ਸ਼ਾਮਲ ਹੈ।

source: Water metering provides real-time data on water usage, enabling farmers to optimize irrigation and conserve water resources effectively.
pa: ਪਾਣੀ ਮਾਪਣ ਨਾਲ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਬਾਰੇ ਰੀਅਲ-ਟਾਈਮ ਡੇਟਾ ਮਿਲਦਾ ਹੈ, ਜਿਸ ਨਾਲ ਕਿਸਾਨ ਸਿੰਚਾਈ ਨੂੰ ਸੁਧਾਰ ਸਕਦੇ ਹਨ ਅਤੇ ਪਾਣੀ ਦੇ ਸਰੋਤਾਂ ਦੀ ਸੰਭਾਲ ਕਰ ਸਕਦੇ ਹਨ।

source: Accurate water metering helps track consumption, detect leaks, and supports water-saving policies and incentive programs.
pa: ਪਾਣੀ ਦੀ ਸਹੀ ਮਾਪ ਨਾਲ ਵਰਤੋਂ ਦੀ ਨਿਗਰਾਨੀ, ਲੀਕ ਦੀ ਪਛਾਣ ਅਤੇ ਪਾਣੀ-ਬਚਤ ਨੀਤੀਆਂ ਅਤੇ ਪ੍ਰੋਤਸਾਹਨ ਪ੍ਰੋਗਰਾਮਾਂ ਨੂੰ ਸਹਿਯੋਗ ਮਿਲਦਾ ਹੈ।

source: Continuous monitoring of water levels in fields ensures optimal irrigation, preventing waterlogging or drought stress.
pa: ਖੇਤਾਂ ਵਿੱਚ ਪਾਣੀ ਦੀ ਸਤਰ ਦੀ ਲਗਾਤਾਰ ਨਿਗਰਾਨੀ ਨਾਲ ਵਧੀਆ ਸਿੰਚਾਈ ਹੁੰਦੀ ਹੈ ਅਤੇ ਪਾਣੀ ਭਰਾਅ ਜਾਂ ਸੁੱਕੇ ਦਾ ਖਤਰਾ ਘਟਦਾ ਹੈ।

source: Accurate water level data helps prevent over-irrigation and supports sustainable groundwater management. Integration with automated irrigation systems enhances water use efficiency.
pa: ਸਹੀ ਪਾਣੀ ਦੀ ਸਤਰ ਡੇਟਾ ਨਾਲ ਵੱਧ ਸਿੰਚਾਈ ਰੋਕੀ ਜਾਂਦੀ ਹੈ ਅਤੇ ਟਿਕਾਊ ਭੂਜਲ ਪ੍ਰਬੰਧਨ ਨੂੰ ਸਹਿਯੋਗ ਮਿਲਦਾ ਹੈ। ਆਟੋਮੈਟਿਕ ਸਿੰਚਾਈ ਪ੍ਰਣਾਲੀ ਨਾਲ ਮਿਲਾ ਕੇ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਦੀ ਕਾਰਗੁਜ਼ਾਰੀ ਵਧਦੀ ਹੈ।

source: Remote sensing technology uses satellite imagery to monitor crop health, soil moisture, and agricultural productivity from a distance.
pa: ਰਿਮੋਟ ਸੈਂਸਿੰਗ ਸੈਟੈਲਾਈਟ ਅਤੇ ਡਰੋਨ ਤਸਵੀਰਾਂ ਰਾਹੀਂ ਫਸਲ ਦੀ ਸਿਹਤ, ਮਿੱਟੀ ਦੀ ਹਾਲਤ ਅਤੇ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਦੀ ਨਿਗਰਾਨੀ ਕਰਦੀ ਹੈ।

source: Explore our comprehensive collection of insights, guides, and resources to enhance your understanding
pa: ਆਪਣੀ ਸਮਝ ਵਧਾਉਣ ਲਈ ਸਾਡੀ ਵਿਸਤ੍ਰਿਤ ਜਾਣਕਾਰੀ, ਗਾਈਡਾਂ ਅਤੇ ਸਰੋਤਾਂ ਦੀ ਸੰਕਲਪਨਾ ਵੇਖੋ

source: Agriculture in Punjab
pa: ਪੰਜਾਬ ਵਿੱਚ ਖੇਤੀਬਾੜੀ

source: Punjab, often referred to as the "Granary of India", is one of the most agriculturally prosperous states in the country. The state's agricultural success is largely attributed to the Green Revolution of the 1960s, which introduced high-yielding varieties (HYVs), mechanization, and chemical fertilizers, transforming Punjab into a leading food producer.
pa: ਪੰਜਾਬ, ਜਿਸਨੂੰ ਅਕਸਰ "ਭਾਰਤ ਦਾ ਅੰਨ ਭੰਡਾਰ" ਕਿਹਾ ਜਾਂਦਾ ਹੈ, ਦੇਸ਼ ਦੇ ਸਭ ਤੋਂ ਖੇਤੀਬਾੜੀਕ ਪੱਖੋਂ ਤਰੱਕੀਸ਼ੀਲ ਰਾਜਾਂ ਵਿੱਚੋਂ ਇੱਕ ਹੈ। ਪੰਜਾਬ ਦੀ ਖੇਤੀਬਾੜੀ ਦੀ ਸਫਲਤਾ ਮੁੱਖ ਤੌਰ 'ਤੇ 1960 ਦੇ ਦਹਾਕੇ ਦੀ ਹਰੀ ਕ੍ਰਾਂਤੀ ਨੂੰ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ, ਜਿਸ ਨੇ ਉੱਚ ਉਪਜ ਵਾਲੀਆਂ ਕਿਸਮਾਂ (HYVs), ਮਕੈਨੀਕਲ ਤਕਨੀਕ ਅਤੇ ਰਸਾਇਣਕ ਖਾਦਾਂ ਲਿਆ ਕੇ ਪੰਜਾਬ ਨੂੰ ਭਾਰਤ ਦਾ ਮੁੱਖ ਅਨਾਜ ਉਤਪਾਦਕ ਰਾਜ ਬਣਾ ਦਿੱਤਾ।

source: To know more about this topic click here
pa: ਇਸ ਵਿਸ਼ੇ ਬਾਰੇ ਹੋਰ ਜਾਣਨ ਲਈ ਇੱਥੇ ਕਲਿੱਕ ਕਰੋ

source: Crop residue management
pa: ਫਸਲ ਬਚਤ ਪ੍ਰਬੰਧਨ

source: At the end of the rice season farmers use the combine to harvest rice, this leaves hard stubbles at the root of the plant projecting 10-15 cm above surface level. Thereafter, farmers will plough the field with a reaper to cut these stubbles leaving behind straw.
pa: ਚੌਲ ਦੇ ਮੌਸਮ ਦੇ ਅੰਤ 'ਤੇ ਕਿਸਾਨ ਕਾਂਬਾਈਨ ਨਾਲ ਚੌਲ ਦੀ ਕਟਾਈ ਕਰਦੇ ਹਨ, ਜਿਸ ਨਾਲ ਪੌਦੇ ਦੀ ਜੜ੍ਹ 'ਤੇ 10-15 ਸੈਂਟੀਮੀਟਰ ਉੱਚੀਆਂ ਸਖ਼ਤ ਡੰਡੀਆਂ ਰਹਿ ਜਾਂਦੀਆਂ ਹਨ। ਇਸ ਤੋਂ ਬਾਅਦ, ਕਿਸਾਨ ਰੀਪਰ ਨਾਲ ਖੇਤ ਨੂੰ ਜੋਤਦੇ ਹਨ ਤਾਂ ਜੋ ਇਹ ਡੰਡੀਆਂ ਕੱਟੀਆਂ ਜਾ ਸਕਣ ਅਤੇ ਪਰਾਲੀ ਪਿੱਛੇ ਰਹਿ ਜਾਂਦੀ ਹੈ।

source: Direct Seeded Rice
pa: ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ

source: The Direct Seeded Rice (DSR) method is an emerging alternative to traditional transplanting. Unlike the transplanting method, DSR involves sowing rice seeds with a tractor-seeder directly into the field without a separate nursery or puddling.
pa: ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR) ਤਰੀਕਾ ਰਵਾਇਤੀ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਦਾ ਇੱਕ ਨਵਾਂ ਵਿਕਲਪ ਹੈ। ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਤਰੀਕੇ ਤੋਂ ਵੱਖ, DSR ਵਿੱਚ ਟ੍ਰੈਕਟਰ-ਸੀਡਰ ਰਾਹੀਂ ਬੀਜਾਂ ਨੂੰ ਸਿੱਧਾ ਖੇਤ ਵਿੱਚ ਬਿਜਿਆ ਜਾਂਦਾ ਹੈ, ਨਰਸਰੀ ਜਾਂ ਪਡਲਿੰਗ ਦੀ ਲੋੜ ਨਹੀਂ ਹੁੰਦੀ।

source: Farm
pa: ਖੇਤ

source: A piece of land with a distinct irrigation source that can be identified. It is cultivated by a main operator, that is the owner or leaseholder of the farm land.
pa: ਇੱਕ ਖੇਤ ਉਹ ਜ਼ਮੀਨ ਦਾ ਟੁਕੜਾ ਹੁੰਦਾ ਹੈ ਜਿਸਦਾ ਆਪਣਾ ਸਿੰਚਾਈ ਸਰੋਤ ਹੁੰਦਾ ਹੈ। ਇਸਨੂੰ ਮੁੱਖ ਓਪਰੇਟਰ (ਮਾਲਕ ਜਾਂ ਪੱਟੇਦਾਰ) ਵੱਲੋਂ ਖੇਤੀਬਾੜੀ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ।

source: Stages of Paddy rice
pa: ਧਾਨ ਦੇ ਪੜਾਅ

source: The growth stages of paddy rice (Oryza sativa) can be broadly divided into four key phases. Click below to learn about these phases in detail.
pa: ਧਾਨ (Oryza sativa) ਦੇ ਵਾਧੂ ਪੜਾਅ ਚਾਰ ਮੁੱਖ ਹਿੱਸਿਆਂ ਵਿੱਚ ਵੰਡੇ ਜਾ ਸਕਦੇ ਹਨ। ਹਰੇਕ ਪੜਾਅ ਬਾਰੇ ਵਿਸਥਾਰ ਨਾਲ ਜਾਣਨ ਲਈ ਹੇਠਾਂ ਕਲਿੱਕ ਕਰੋ।

source: Transplanting Rice
pa: ਚੌਲ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ

source: The transplanting rice (TPR) method of rice cultivation has been a traditional and widely practiced technique in Punjab, India, where rice is the major kharif (monsoon) crop. This method involves raising seedlings in a separate nursery and then transplanting them into a puddled, waterlogged field.
pa: ਚੌਲ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ (TPR) ਤਰੀਕਾ ਪੰਜਾਬ, ਭਾਰਤ ਵਿੱਚ ਚੌਲ ਦੀ ਖੇਤੀ ਦਾ ਰਵਾਇਤੀ ਅਤੇ ਵਿਆਪਕ ਤਰੀਕਾ ਹੈ, ਜਿੱਥੇ ਚੌਲ ਮੁੱਖ ਖਰੀਫ਼ (ਮਾਨਸੂਨ) ਫਸਲ ਹੈ। ਇਸ ਤਰੀਕੇ ਵਿੱਚ ਪੁੱਗੀਆਂ ਨਰਸਰੀ ਵਿੱਚ ਉਗਾਈਆਂ ਜਾਂਦੀਆਂ ਹਨ ਅਤੇ ਫਿਰ ਪਾਣੀ ਨਾਲ ਭਰੇ ਖੇਤ ਵਿੱਚ ਟ੍ਰਾਂਸਪਲਾਂਟ ਕੀਤਾ ਜਾਂਦਾ ਹੈ।

source: Tube-well
pa: ਟਿਊਬ-ਵੈਲ

source: Tube-well is by far the most pervasive source of irrigation in the area. It is a bore-well dug under the surface level the depth of which can vary between areas but it is 100 to 400ft, mostly around 200ft. The tube-well is called like this as it is a bore in a tube shape. Its diameter tends to be small, relative to the traditional wells. Diameter is usually 3-6".
pa: ਟਿਊਬ-ਵੈਲ ਇਲਾਕੇ ਵਿੱਚ ਸਭ ਤੋਂ ਆਮ ਸਿੰਚਾਈ ਸਰੋਤ ਹੈ। ਇਹ ਜ਼ਮੀਨ ਹੇਠਾਂ ਖੋਦੀ ਜਾਂਦੀ ਬੋਰ-ਵੈਲ ਹੁੰਦੀ ਹੈ, ਜਿਸ ਦੀ ਗਹਿਰਾਈ ਖੇਤਰ ਅਨੁਸਾਰ 100 ਤੋਂ 400 ਫੁੱਟ (ਆਮ ਤੌਰ 'ਤੇ 200 ਫੁੱਟ) ਹੁੰਦੀ ਹੈ। ਟਿਊਬ-ਵੈਲ ਦਾ ਨਾਂ ਇਸ ਲਈ ਪਿਆ ਹੈ ਕਿਉਂਕਿ ਇਹ ਟਿਊਬ ਆਕਾਰ ਦੀ ਬੋਰ ਹੁੰਦੀ ਹੈ। ਇਸ ਦਾ ਵਿਆਸ ਰਵਾਇਤੀ ਖੂਹਾਂ ਨਾਲੋਂ ਛੋਟਾ ਹੁੰਦਾ ਹੈ, ਆਮ ਤੌਰ 'ਤੇ 3-6 ਇੰਚ।

source: Empowering Farmers, Sustaining Punjab
pa: ਕਿਸਾਨਾਂ ਨੂੰ ਸਸ਼ਕਤ ਕਰਨਾ, ਪੰਜਾਬ ਨੂੰ ਟਿਕਾਊ ਬਣਾਉਣਾ

source: We are actively engaging with a cohort of 500 farmers across Patiala District as part of a comprehensive field research initiative aimed at improving irrigation practices and understanding on-farm water use in the aim to alleviate farmers' livelihoods and increase their income while maintaining food security in India. Our team conducts regular visits to each farm, where we carry out structured surveys to capture detailed information on farming practices, irrigation behavior, and crop decisions. At the same time, we are systematically measuring groundwater levels and installing water meters to monitor actual water use at the plot level. Each farm is geo-mapped to ensure spatial precision and enable integration with remote sensing and hydrological models.
pa: ਅਸੀਂ ਪਟਿਆਲਾ ਜ਼ਿਲ੍ਹੇ ਦੇ 500 ਕਿਸਾਨਾਂ ਦੇ ਸਮੂਹ ਨਾਲ ਸਰਗਰਮ ਸੰਪਰਕ ਕਰ ਰਹੇ ਹਾਂ, ਜੋ ਕਿ ਖੇਤਰੀ ਖੋਜ ਪहल ਦਾ ਹਿੱਸਾ ਹੈ, ਜਿਸ ਦਾ ਉਦੇਸ਼ ਸਿੰਚਾਈ ਤਰੀਕਿਆਂ ਵਿੱਚ ਸੁਧਾਰ ਅਤੇ ਖੇਤ ਪੱਧਰ 'ਤੇ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਦੀ ਸਮਝ ਵਧਾਉਣਾ ਹੈ, ਤਾਂ ਜੋ ਕਿਸਾਨਾਂ ਦੀ ਜੀਵਨ-ਜੀਵਿਕਾ ਸੁਧਾਰੀ ਜਾਵੇ, ਆਮਦਨ ਵਧਾਈ ਜਾਵੇ ਅਤੇ ਭਾਰਤ ਵਿੱਚ ਖਾਦ ਸੁਰੱਖਿਆ ਬਣਾਈ ਰੱਖੀ ਜਾਵੇ। ਸਾਡੀ ਟੀਮ ਹਰ ਖੇਤ 'ਤੇ ਨਿਯਮਤ ਦੌਰੇ ਕਰਦੀ ਹੈ, ਜਿੱਥੇ ਅਸੀਂ ਵਿਧੀਬੱਧ ਸਰਵੇਖਣ ਕਰਕੇ ਖੇਤੀ ਤਰੀਕਿਆਂ, ਸਿੰਚਾਈ ਵਿਹਾਰ ਅਤੇ ਫਸਲ ਚੋਣ ਬਾਰੇ ਵਿਸਥਾਰਕ ਜਾਣਕਾਰੀ ਇਕੱਤਰ ਕਰਦੇ ਹਾਂ। ਇਸਦੇ ਨਾਲ-ਨਾਲ, ਅਸੀਂ ਵਿਗਿਆਨਕ ਢੰਗ ਨਾਲ ਭੂਜਲ ਦੀ ਸਤਰ ਮਾਪ ਰਹੇ ਹਾਂ ਅਤੇ ਪਲਾਟ ਪੱਧਰ 'ਤੇ ਅਸਲ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਦੀ ਨਿਗਰਾਨੀ ਲਈ ਪਾਣੀ ਮੀਟਰ ਲਗਾ ਰਹੇ ਹਾਂ। ਹਰ ਖੇਤ ਨੂੰ ਜਿਓ-ਮੈਪ ਕੀਤਾ ਜਾਂਦਾ ਹੈ, ਤਾਂ ਜੋ ਅਸਥਾਈ ਸਹੀਤਾ ਯਕੀਨੀ ਬਣਾਈ ਜਾਵੇ ਅਤੇ ਰਿਮੋਟ ਸੈਂਸਿੰਗ ਤੇ ਹਾਈਡ੍ਰੋਲੋਜੀ ਮਾਡਲਾਂ ਨਾਲ ਇਕਾਈਕਰਨ ਹੋ ਸਕੇ।

source: See more
pa: ਹੋਰ ਵੇਖੋ

source: Meet Our Team
pa: ਟੀਮ ਨੂੰ ਮਿਲੋ

source: The minds behind the innovation
pa: ਨਵੀਨਤਾ ਦੇ ਪਿੱਛੇ ਦਿਮਾਗ

source: Principal Investigators
pa: ਮੁੱਖ ਖੋਜਕਾਰ

source: Prof. Karun Verma
pa: ਪ੍ਰੋ. ਕਰੁਣ ਵਰਮਾ

source: Associate Professor at Thapar Institute of Engineering & Technology
pa: ਥਾਪਰ ਇੰਸਟੀਚਿਊਟ ਆਫ ਇੰਜੀਨੀਅਰਿੰਗ ਐਂਡ ਟੈਕਨੋਲੋਜੀ ਵਿੱਚ ਐਸੋਸੀਏਟ ਪ੍ਰੋਫੈਸਰ

source: View Profile
pa: ਪ੍ਰੋਫਾਈਲ ਵੇਖੋ

source: Prof. Amit Mishra
pa: ਪ੍ਰੋ. ਅਮਿਤ ਮਿਸ਼ਰਾ

source: Associate Professor at Thapar Institute of Engineering and Technology
pa: ਥਾਪਰ ਇੰਸਟੀਚਿਊਟ ਆਫ ਇੰਜੀਨੀਅਰਿੰਗ ਐਂਡ ਟੈਕਨੋਲੋਜੀ ਵਿੱਚ ਐਸੋਸੀਏਟ ਪ੍ਰੋਫੈਸਰ

source: Lead Researcher
pa: ਮੁੱਖ ਖੋਜਕਾਰ

source: Dan Etgar
pa: ਡੈਨ ਐਟਗਾਰ

source: Lead Researcher, PhD Candidate at Tel Aviv University
pa: ਮੁੱਖ ਖੋਜਕਾਰ, ਟੈਲ-ਅਵੀਵ ਯੂਨੀਵਰਸਿਟੀ ਵਿੱਚ ਪੀਐਚਡੀ ਉਮੀਦਵਾਰ

source: Field Researchers
pa: ਖੇਤ ਖੋਜਕਾਰ

source: Liron Dana
pa: ਲੀਰੋਨ ਡਾਨਾ

source: Field Researcher
pa: ਖੇਤ ਖੋਜਕਾਰ

source: M.A. in Sustainable Development
pa: ਟਿਕਾਊ ਵਿਕਾਸ ਵਿੱਚ M.A.

source: Marcello Liberman
pa: ਮਾਰਸੈਲੋ ਲੀਬਰਮੈਨ

source: Shir Choen
pa: ਸ਼ਿਰ ਕੋਹਨ

source: Research Field Team
pa: ਖੋਜ ਖੇਤ ਟੀਮ

source: Gunteshwar Singh
pa: ਗੁੰਤੇਸ਼ਵਰ ਸਿੰਘ

source: Field Manager
pa: ਖੇਤ ਮੈਨੇਜਰ

source: Satyam Yadav
pa: ਸਤਿਆਮ ਯਾਦਵ

source: Lead Research Assistant
pa: ਮੁੱਖ ਖੋਜ ਸਹਾਇਕ
