Repository: DigitalVillage-TIET/Digi-Portal
Catalog: digivi/locale/*/LC_MESSAGES/django.po
Languages: pa

source: Gaurav Sharma
pa: ਗੌਰਵ ਸ਼ਰਮਾ

source: Student Interns
pa: ਵਿਦਿਆਰਥੀ ਇੰਟਰਨ

source: Danish Sharma
pa: ਦਾਨਿਸ਼ ਸ਼ਰਮਾ

source: Final Year B.E. Student at TIET, Senior Data Sci. and SDE intern
pa: TIET ਵਿੱਚ ਆਖਰੀ ਸਾਲ ਦਾ B.E. ਵਿਦਿਆਰਥੀ, ਸੀਨੀਅਰ ਡਾਟਾ ਵਿਗਿਆਨ ਅਤੇ SDE ਇੰਟਰਨ

source: Samrath Singh Kharbanda
pa: ਸਮਰਥ ਸਿੰਘ ਖਰਬੰਦਾ

source: Ashmit Cajla
pa: ਅਸ਼ਮਿਤ ਕਾਜਲਾ

source: Pre-Final Year B.E. Student at TIET, Junior Data Sci. and SDE intern
pa: TIET ਵਿੱਚ ਪ੍ਰੀ-ਫਾਈਨਲ ਸਾਲ ਦਾ B.E. ਵਿਦਿਆਰਥੀ, ਜੂਨੀਅਰ ਡਾਟਾ ਵਿਗਿਆਨ ਅਤੇ SDE ਇੰਟਰਨ

source: Development Team
pa: ਡਿਵੈਲਪਮੈਂਟ ਟੀਮ

source: Prof. Karun
pa: ਪ੍ਰੋ. ਕਰੁਣ

source: Prof. Jhilik Bhattacharya
pa: ਪ੍ਰੋ. ਝਿਲਿਕ ਭਟਾਚਾਰਿਆ

source: Associate Professor & Associate Head at Thapar Institute of Engineering & Technology
pa: ਥਾਪਰ ਇੰਸਟੀਚਿਊਟ ਆਫ ਇੰਜੀਨੀਅਰਿੰਗ ਐਂਡ ਟੈਕਨੋਲੋਜੀ ਵਿੱਚ ਐਸੋਸੀਏਟ ਪ੍ਰੋਫੈਸਰ ਅਤੇ ਐਸੋਸੀਏਟ ਹੈੱਡ

source: Prof. Hadas Mamane
pa: ਪ੍ਰੋ. ਹਾਦਾਸ ਮਾਮਾਨੇ

source: Professor of Water Technologies at Tel Aviv University
pa: ਟੈਲ-ਅਵੀਵ ਯੂਨੀਵਰਸਿਟੀ ਵਿੱਚ ਪਾਣੀ ਤਕਨੀਕਾਂ ਦੇ ਪ੍ਰੋਫੈਸਰ

source: Prof. Ram
pa: ਪ੍ਰੋ. ਰਾਮ

source: Associate Professor of Public Policy, Tel Aviv University, and Director, Nitsan Lab for Sustainable Development
pa: ਟੈਲ-ਅਵੀਵ ਯੂਨੀਵਰਸਿਟੀ ਵਿੱਚ ਪਬਲਿਕ ਪਾਲਿਸੀ ਦੇ ਐਸੋਸੀਏਟ ਪ੍ਰੋਫੈਸਰ ਅਤੇ ਨਿਤਸਨ ਲੈਬ (ਟਿਕਾਊ ਵਿਕਾਸ ਲਈ) ਦੇ ਡਾਇਰੈਕਟਰ

source: Rinat Kaplan
pa: ਰੀਨਾਤ ਕਪਲਾਨ

source: B.Sc in Agriculture
pa: ਖੇਤੀਬਾੜੀ ਵਿੱਚ ਬੀ.ਐਸਸੀ

source: Yotam golan
pa: ਯੋਤਾਮ ਗੋਲਾਨ

source: Briana Wiser
pa: ਬਰੀਆਨਾ ਵਾਈਜ਼ਰ

source: Rotem Mayer
pa: ਰੋਟਮ ਮਾਇਰ

source: Rotem Hanan
pa: ਰੋਟਮ ਹਨਾਨ

source: Ziv Hilel
pa: ਜ਼ਿਵ ਹਿਲੇਲ

source: B.A. in Philosopy, Politics, Economics
pa: ਫਿਲਾਸਫੀ, ਰਾਜਨੀਤੀ, ਅਰਥਸ਼ਾਸਤਰ ਵਿੱਚ ਬੀ.ਏ.

source: Pre-Final Year B.E. Student at TIET, Senior Data Sci. and SDE intern
pa: TIET ਵਿੱਚ ਪ੍ਰੀ-ਫਾਈਨਲ ਸਾਲ ਦਾ B.E. ਵਿਦਿਆਰਥੀ, ਸੀਨੀਅਰ ਡਾਟਾ ਵਿਗਿਆਨ ਅਤੇ SDE ਇੰਟਰਨ

source: Mehakpreet Kaur
pa: ਮਹਕਪ੍ਰੀਤ ਕੌਰ

source: Pre-Final Year B.E. Student at TIET and Web Portal Development Intern
pa: TIET ਵਿੱਚ ਪ੍ਰੀ-ਫਾਈਨਲ ਸਾਲ ਦਾ B.E. ਵਿਦਿਆਰਥੀ ਅਤੇ ਵੈੱਬ ਪੋਰਟਲ ਡਿਵੈਲਪਮੈਂਟ ਇੰਟਰਨ

source: Alysha Mahajan
pa: ਅਲੀਸ਼ਾ ਮਹਾਜਨ

source: Aakash Chandra
pa: ਆਕਾਸ਼ ਚੰਦਰ

source: Kismat Gill
pa: ਕਿਸਮਤ ਗਿੱਲ

source: Final Year B.E. Student at TIET and Data Science intern
pa: TIET ਵਿੱਚ ਆਖਰੀ ਸਾਲ ਦਾ B.E. ਵਿਦਿਆਰਥੀ ਅਤੇ ਡਾਟਾ ਵਿਗਿਆਨ ਇੰਟਰਨ

source: Hardik Garg
pa: ਹਾਰਦਿਕ ਗਰਗ

source: Final Year B.E. Student at TIET and Remote Sensing intern
pa: TIET ਵਿੱਚ ਆਖਰੀ ਸਾਲ ਦਾ B.E. ਵਿਦਿਆਰਥੀ ਅਤੇ ਰਿਮੋਟ ਸੈਂਸਿੰਗ ਇੰਟਰਨ

source: Shubham Rajdev
pa: ਸ਼ੁਭਮ ਰਾਜਦੇਵ

source: Pre-Final Year B.E. Student at TIET and IoT Systemts Intern
pa: TIET ਵਿੱਚ ਪ੍ਰੀ-ਫਾਈਨਲ ਸਾਲ ਦਾ B.E. ਵਿਦਿਆਰਥੀ ਅਤੇ IoT ਪ੍ਰਣਾਲੀ ਇੰਟਰਨ

source: Asmi Gaurav
pa: ਅਸਮੀ ਗੌਰਵ

source: Napinder Singh
pa: ਨਪਿੰਦਰ ਸਿੰਘ

source: Kanwar Ajay Singh
pa: ਕਨਵਰ ਅਜੈ ਸਿੰਘ

source: Senior Field Assistant
pa: ਸੀਨੀਅਰ ਖੇਤ ਸਹਾਇਕ

source: Satnam Singh
pa: ਸਤਨਾਮ ਸਿੰਘ

source: Yogesh Sharma
pa: ਯੋਗੇਸ਼ ਸ਼ਰਮਾ

source: Skilled Field Assistant
pa: ਮਾਹਿਰ ਖੇਤ ਸਹਾਇਕ

source: Username
pa: ਯੂਜ਼ਰਨਾਮ

source: Password
pa: ਪਾਸਵਰਡ

source: Login
pa: ਲੌਗਇਨ

source: Field Mapping Analysis
pa: ਖੇਤ ਨਕਸ਼ਾ ਵਿਸ਼ਲੇਸ਼ਣ

source: Advanced GIS tools for field boundary mapping, crop monitoring, and spatial analysis of agricultural data with satellite imagery integration.
pa: ਖੇਤ ਸੀਮਾ ਨਕਸ਼ੇ ਬਣਾਉਣ, ਫਸਲ ਨਿਗਰਾਨੀ ਅਤੇ ਖੇਤੀ ਵਾਲੇ ਡੇਟਾ ਤੇ ਸੈਟੈਲਾਈਟ ਤਸਵੀਰਾਂ ਦੀ ਅਸਥਾਈ ਵਿਸ਼ਲੇਸ਼ਣ ਲਈ ਅਧੁਨਿਕ GIS ਸੰਦ।

source: Coming Soon: Advanced GIS Platform
pa: ਜਲਦੀ ਆ ਰਿਹਾ: ਉੱਨਤ GIS ਪਲੇਟਫਾਰਮ

source: Field Grid Puzzle
pa: ਖੇਤ ਗਰਿੱਡ ਪਹੇਲੀ

source: Arrange the field tiles in order while we develop the mapping tool!
pa: ਜਦੋਂ ਅਸੀਂ ਨਕਸ਼ਾ ਸੰਦ ਤਿਆਰ ਕਰ ਰਹੇ ਹਾਂ, ਖੇਤ ਦੀਆਂ ਟਾਈਲਾਂ ਨੂੰ ਠੀਕ ਕ੍ਰਮ ਵਿੱਚ ਲਾਓ!

source: 3×3 Easy
pa: 3×3 ਆਸਾਨ

source: 4×4 Medium
pa: 4×4 ਦਰਮਿਆਨਾ

source: Grid Size
pa: ਗਰਿੱਡ ਆਕਾਰ

source: Shuffle
pa: ਸ਼ਫਲ ਕਰੋ

source: Solve
pa: ਹੱਲ ਕਰੋ

source: Field Mapped Successfully!
pa: ਖੇਤ ਸਫਲਤਾਪੂਰਵਕ ਨਕਸ਼ਾ ਬਣਾਇਆ ਗਿਆ!

source: Great job organizing the field grid!
pa: ਖੇਤ ਗਰਿੱਡ ਨੂੰ ਵਧੀਆ ਢੰਗ ਨਾਲ ਲਗਾਇਆ!

source: Development Preview
pa: ਵਿਕਾਸ ਝਲਕ

source: Processing Legacy Data
pa: ਪੁਰਾਣਾ ਡੇਟਾ ਪ੍ਰੋਸੈਸ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ

source: Processing your 2024 format files...
pa: ਤੁਹਾਡੀਆਂ 2024 ਫਾਰਮੈਟ ਫਾਈਲਾਂ ਪ੍ਰੋਸੈਸ ਹੋ ਰਹੀਆਂ ਹਨ...

source: Complete
pa: ਪੂਰਾ ਹੋਇਆ

source: Legacy Data Analysis System
pa: ਪੁਰਾਣਾ ਡੇਟਾ ਵਿਸ਼ਲੇਸ਼ਣ ਪ੍ਰਣਾਲੀ

source: 2024 Format
pa: 2024 ਫਾਰਮੈਟ

source: 2025 Format
pa: 2025 ਫਾਰਮੈਟ

source: Legacy Data Upload Terminal
pa: ਪੁਰਾਣਾ ਡੇਟਾ ਅਪਲੋਡ ਟਰਮੀਨਲ

source: Legacy Format Processing
pa: ਪੁਰਾਣਾ ਫਾਰਮੈਟ ਪ੍ਰੋਸੈਸ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ

source: Meter Reading Data File
pa: ਮੀਟਰ ਪੜ੍ਹਨ ਵਾਲੀ ਡੇਟਾ ਫਾਈਲ

source: Upload your 2024 format meter reading Excel file
pa: ਆਪਣੀ 2024 ਫਾਰਮੈਟ ਮੀਟਰ ਪੜ੍ਹਨ ਵਾਲੀ ਐਕਸਲ ਫਾਈਲ ਅਪਲੋਡ ਕਰੋ

source: Master Database File
pa: ਮਾਸਟਰ ਡਾਟਾਬੇਸ ਫਾਈਲ

source: Upload the corresponding master database file
pa: ਸੰਬੰਧਤ ਮਾਸਟਰ ਡਾਟਾਬੇਸ ਫਾਈਲ ਅਪਲੋਡ ਕਰੋ

source: Upload & Analyze Data
pa: ਡੇਟਾ ਅਪਲੋਡ ਕਰੋ ਅਤੇ ਵਿਸ਼ਲੇਸ਼ਣ ਕਰੋ

source: Legacy Data Successfully Processed
pa: ਪੁਰਾਣਾ ਡੇਟਾ ਸਫਲਤਾਪੂਰਵਕ ਪ੍ਰੋਸੈਸ ਹੋ ਗਿਆ

source: Last Upload:
pa: ਆਖਰੀ ਅਪਲੋਡ:

source: Format:
pa: ਫਾਰਮੈਟ:

source: Kharif 2024 Legacy
pa: ਖਰੀਫ਼ 2024 ਪੁਰਾਣਾ

source: Status:
pa: ਸਥਿਤੀ:

source: Farm Selection Panel
pa: ਖੇਤ ਚੋਣ ਪੈਨਲ

source: Farm Identifier
pa: ਖੇਤ ਪਛਾਣਕਰਤਾ

source: -- Select farm unit --
pa: -- ਖੇਤ ਯੂਨਿਟ ਚੁਣੋ --

source: Analyze Farm
pa: ਖੇਤ ਵਿਸ਼ਲੇਸ਼ਣ ਕਰੋ

source: Data Visualization Matrix
pa: ਡੇਟਾ ਵਿਜ਼ੂਅਲਾਈਜ਼ੇਸ਼ਨ ਮੈਟ੍ਰਿਕਸ

source: Meter Unit <span class="code">%(result.meter)s</span>
pa: ਮੀਟਰ ਯੂਨਿਟ <span class="code">%(result.meter)s</span>

source: Size:
pa: ਆਕਾਰ:

source: Acres
pa: ਏਕੜ

source: Type:
pa: ਕਿਸਮ:

source: Analysis Plot %(forloop.counter)s
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਪਲਾਟ %(forloop.counter)s

source: Toggle visibility
pa: ਦਿੱਖ ਬਦਲੋ

source: Data visualization for %(result.meter)s
pa: %(result.meter)s ਲਈ ਡੇਟਾ ਵਿਜ਼ੂਅਲਾਈਜ਼ੇਸ਼ਨ

source: Visualization Hidden
pa: ਵਿਜ਼ੂਅਲਾਈਜ਼ੇਸ਼ਨ ਲੁਕਾਇਆ ਗਿਆ

source: Digi-Village Water Meter Analysis Platform
pa: ਡਿਜੀ-ਵਿਲੇਜ ਪਾਣੀ ਮੀਟਰ ਵਿਸ਼ਲੇਸ਼ਣ ਪਲੇਟਫਾਰਮ

source: Version 1.0 (Legacy)
pa: ਵਰਜਨ 1.0 (ਪੁਰਾਣਾ)

source: 3D Interactive Rice Plant Growth Stages
pa: 3D ਇੰਟਰਐਕਟਿਵ ਚੌਲ ਪੌਦੇ ਦੇ ਵਾਧੂ ਪੜਾਅ

source: Transplanting
pa: ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ

source: Vegetative
pa: ਵੈਜੀਟੇਟਿਵ

source: Reproductive
pa: ਰੀਪ੍ਰੋਡਕਟਿਵ

source: Maturity
pa: ਪੱਕਣ

source: Click to learn about the Transplanting stage
pa: ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਪੜਾਅ ਬਾਰੇ ਜਾਣਨ ਲਈ ਕਲਿੱਕ ਕਰੋ

source: Click to learn about the Vegetative stage
pa: ਵੈਜੀਟੇਟਿਵ ਪੜਾਅ ਬਾਰੇ ਜਾਣਨ ਲਈ ਕਲਿੱਕ ਕਰੋ

source: Click to learn about the Reproductive stage
pa: ਰੀਪ੍ਰੋਡਕਟਿਵ ਪੜਾਅ ਬਾਰੇ ਜਾਣਨ ਲਈ ਕਲਿੱਕ ਕਰੋ

source: Click to learn about the Maturity stage
pa: ਪੱਕਣ ਪੜਾਅ ਬਾਰੇ ਜਾਣਨ ਲਈ ਕਲਿੱਕ ਕਰੋ

source: Transplanting (Establishment)
pa: ਚੌਲ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ

source: After seedlings are grown in a nursery for 25–35 days, they are either transplanted into the main field using the Transplanted Rice (TPR) method or sown directly through Direct Seeded Rice (DSR). During this stage, root establishment begins as the seedlings adapt to the new field environment. The plants experience stress due to uprooting in the TPR method and the adjustment to different environmental conditions. Adequate irrigation is crucial at this point to support survival and proper establishment. This stage typically lasts for about 10–15 days post-transplanting. Critical factors influencing success include good puddling and leveling of the field, along with proper spacing and depth during transplanting.
pa: ਨਰਸਰੀ ਵਿੱਚ ਪੁੱਗੀਆਂ 25–35 ਦਿਨ ਉਗਣ ਤੋਂ ਬਾਅਦ, ਉਨ੍ਹਾਂ ਨੂੰ ਜਾਂ ਤਾਂ ਮੁੱਖ ਖੇਤ ਵਿੱਚ ਟ੍ਰਾਂਸਪਲਾਂਟਡ ਚੌਲ (TPR) ਤਰੀਕੇ ਨਾਲ ਲਾਇਆ ਜਾਂਦਾ ਹੈ ਜਾਂ ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR) ਰਾਹੀਂ ਸਿੱਧਾ ਬੀਜਿਆ ਜਾਂਦਾ ਹੈ। ਇਸ ਪੜਾਅ ਦੌਰਾਨ, ਪੁੱਗੀਆਂ ਨਵੇਂ ਖੇਤ ਦੇ ਵਾਤਾਵਰਣ ਨਾਲ ਅਨੁਕੂਲ ਹੋਦੀਆਂ ਹਨ ਅਤੇ ਜੜਾਂ ਦੀ ਸਥਾਪਨਾ ਸ਼ੁਰੂ ਹੁੰਦੀ ਹੈ। TPR ਤਰੀਕੇ ਵਿੱਚ ਪੁੱਗੀਆਂ ਨੂੰ ਉਖਾੜਨ ਅਤੇ ਵੱਖਰੇ ਵਾਤਾਵਰਣ ਨਾਲ ਅਨੁਕੂਲਤਾ ਕਾਰਨ ਪੌਦਿਆਂ ਨੂੰ ਤਣਾਅ ਹੁੰਦਾ ਹੈ। ਇਸ ਸਮੇਂ ਉਚਿਤ ਸਿੰਚਾਈ ਬਹੁਤ ਜ਼ਰੂਰੀ ਹੈ ਤਾਂ ਜੋ ਪੁੱਗੀਆਂ ਦੀ ਬਚਤ ਅਤੇ ਠੀਕ ਸਥਾਪਨਾ ਹੋ ਸਕੇ। ਇਹ ਪੜਾਅ ਆਮ ਤੌਰ 'ਤੇ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਤੋਂ ਬਾਅਦ 10–15 ਦਿਨ ਤੱਕ ਚਲਦਾ ਹੈ। ਸਫਲਤਾ ਲਈ ਮਹੱਤਵਪੂਰਨ ਗੱਲਾਂ ਵਿੱਚ ਖੇਤ ਦੀ ਵਧੀਆ ਪਡਲਿੰਗ ਅਤੇ ਲੈਵਲਿੰਗ, ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਸਮੇਂ ਠੀਕ ਦੂਰੀ ਅਤੇ ਗਹਿਰਾਈ ਸ਼ਾਮਲ ਹਨ।

source: Vegetative Stage
pa: ਵੈਜੀਟੇਟਿਵ ਪੜਾਅ

source: This is the period of active growth when the rice plant develops leaves, stems, and tillers (side shoots). During this stage, tillers form, which are crucial as they directly determine the number of panicles—the grain-bearing structures. Nutrient uptake, especially nitrogen, increases significantly, making it important to ensure proper fertilization. Effective weed control is essential to minimize competition for resources, and consistent water management is vital to support optimal growth. This stage typically lasts for about 30 to 40 days, depending on the rice variety. Key factors for success include adequate irrigation, timely application of nitrogen-rich fertilizers, and control of pests like stem borers as well as diseases such as bacterial blight.
pa: ਇਹ ਚੌਲ ਪੌਦੇ ਦੇ ਸਰਗਰਮ ਵਾਧੂ ਦਾ ਪੜਾਅ ਹੈ, ਜਿਸ ਦੌਰਾਨ ਪੱਤੇ, ਤਣੇ ਅਤੇ ਟਿਲਰ (ਸਾਈਡ ਸ਼ੂਟ) ਬਣਦੇ ਹਨ। ਇਸ ਪੜਾਅ ਵਿੱਚ ਟਿਲਰ ਬਣਦੇ ਹਨ, ਜੋ ਕਿ ਬਹੁਤ ਮਹੱਤਵਪੂਰਨ ਹਨ ਕਿਉਂਕਿ ਇਹ ਸਿੱਧਾ ਪੈਨਿਕਲ (ਅਨਾਜ ਵਾਲੀ ਬਣਤਰ) ਦੀ ਗਿਣਤੀ ਨਿਰਧਾਰਤ ਕਰਦੇ ਹਨ। ਪੌਸ਼ਟਿਕ ਤੱਤਾਂ, ਖਾਸ ਕਰਕੇ ਨਾਈਟ੍ਰੋਜਨ, ਦੀ ਲੈਣ-ਦੇਣ ਕਾਫੀ ਵਧ ਜਾਂਦੀ ਹੈ, ਇਸ ਲਈ ਠੀਕ ਖਾਦ ਪਾਉਣਾ ਜ਼ਰੂਰੀ ਹੈ। ਘਾਹ-ਨਿਯੰਤਰਣ ਵੀ ਲਾਜ਼ਮੀ ਹੈ ਤਾਂ ਜੋ ਸਰੋਤਾਂ ਲਈ ਮੁਕਾਬਲਾ ਘੱਟ ਹੋਵੇ, ਅਤੇ ਲਗਾਤਾਰ ਪਾਣੀ ਪ੍ਰਬੰਧਨ ਵਧੀਆ ਵਾਧੂ ਲਈ ਜ਼ਰੂਰੀ ਹੈ। ਇਹ ਪੜਾਅ ਆਮ ਤੌਰ 'ਤੇ 30 ਤੋਂ 40 ਦਿਨ ਚਲਦਾ ਹੈ, ਜੋ ਚੌਲ ਦੀ ਕਿਸਮ 'ਤੇ ਨਿਰਭਰ ਕਰਦਾ ਹੈ। ਸਫਲਤਾ ਲਈ ਉਚਿਤ ਸਿੰਚਾਈ, ਸਮੇਂ-ਸਿਰ ਨਾਈਟ੍ਰੋਜਨ-ਅਮੀਰ ਖਾਦ ਪਾਉਣਾ, ਅਤੇ ਤਣੇ ਦੇ ਕੀੜੇ ਜਾਂ ਬੈਕਟੀਰੀਅਲ ਬਲਾਈਟ ਵਰਗੀਆਂ ਬਿਮਾਰੀਆਂ ਦਾ ਕੰਟਰੋਲ ਕਰਨਾ ਮਹੱਤਵਪੂਰਨ ਹੈ।

source: Reproductive Stage
pa: ਰੀਪ੍ਰੋਡਕਟਿਵ ਪੜਾਅ

source: This is the most sensitive phase in the rice plant's lifecycle, during which the plant forms panicles, flowers, and undergoes pollination and fertilization. Panicle initiation marks the start of this stage, where tiny spikelets—future grains—begin to develop. Flowering typically starts at the top of the panicle and progresses downward. The success of pollination and fertilization during this time directly affects grain formation and overall yield. This stage usually lasts around 25 to 30 days, depending on the rice variety. Ensuring a consistent water supply is crucial, as even brief periods of drought can significantly impact yield. Additionally, protecting the crop from pests such as panicle mites and diseases like blast or sheath blight is vital for maintaining grain quality and productivity.
pa: ਇਹ ਚੌਲ ਪੌਦੇ ਦੇ ਜੀਵਨ ਚੱਕਰ ਦਾ ਸਭ ਤੋਂ ਸੰਵੇਦਨਸ਼ੀਲ ਪੜਾਅ ਹੈ, ਜਿਸ ਦੌਰਾਨ ਪੈਨਿਕਲ, ਫੁੱਲ ਬਣਦੇ ਹਨ ਅਤੇ ਪਰਾਗਣ ਤੇ ਫਰਟੀਲਾਈਜ਼ੇਸ਼ਨ ਹੁੰਦੀ ਹੈ। ਪੈਨਿਕਲ ਦੀ ਸ਼ੁਰੂਆਤ ਇਸ ਪੜਾਅ ਦੀ ਸ਼ੁਰੂਆਤ ਦਰਸਾਉਂਦੀ ਹੈ, ਜਿੱਥੇ ਛੋਟੇ-ਛੋਟੇ ਸਪਾਈਕਲੈਟ (ਭਵਿੱਖ ਦੇ ਅਨਾਜ) ਬਣਣ ਲੱਗ ਪੈਂਦੇ ਹਨ। ਫੁੱਲ ਆਮ ਤੌਰ 'ਤੇ ਪੈਨਿਕਲ ਦੇ ਉੱਪਰਲੇ ਹਿੱਸੇ ਤੋਂ ਸ਼ੁਰੂ ਹੁੰਦੇ ਹਨ ਅਤੇ ਹੇਠਾਂ ਵਧਦੇ ਹਨ। ਇਸ ਸਮੇਂ ਪਰਾਗਣ ਅਤੇ ਫਰਟੀਲਾਈਜ਼ੇਸ਼ਨ ਦੀ ਸਫਲਤਾ ਅਨਾਜ ਬਣਨ ਅਤੇ ਕੁੱਲ ਪੈਦਾਵਾਰ 'ਤੇ ਸਿੱਧਾ ਅਸਰ ਪਾਉਂਦੀ ਹੈ। ਇਹ ਪੜਾਅ ਆਮ ਤੌਰ 'ਤੇ 25 ਤੋਂ 30 ਦਿਨ ਚਲਦਾ ਹੈ, ਜੋ ਚੌਲ ਦੀ ਕਿਸਮ 'ਤੇ ਨਿਰਭਰ ਕਰਦਾ ਹੈ। ਲਗਾਤਾਰ ਪਾਣੀ ਦੀ ਸਪਲਾਈ ਯਕੀਨੀ ਬਣਾਉਣਾ ਬਹੁਤ ਜ਼ਰੂਰੀ ਹੈ, ਕਿਉਂਕਿ ਥੋੜ੍ਹੀ ਵੀ ਸੁੱਕੀ ਪੈਣ ਨਾਲ ਪੈਦਾਵਾਰ 'ਤੇ ਵੱਡਾ ਅਸਰ ਪੈ ਸਕਦਾ ਹੈ। ਇਸਦੇ ਨਾਲ, ਪੈਨਿਕਲ ਮਾਈਟ ਜਾਂ ਬਲਾਸਟ, ਸ਼ੀਥ ਬਲਾਈਟ ਵਰਗੀਆਂ ਬਿਮਾਰੀਆਂ ਤੋਂ ਫਸਲ ਦੀ ਰੱਖਿਆ ਕਰਨੀ ਵੀ ਅਨਾਜ ਦੀ ਗੁਣਵੱਤਾ ਅਤੇ ਉਤਪਾਦਕਤਾ ਲਈ ਲਾਜ਼ਮੀ ਹੈ।

source: Maturity (Ripening)
pa: ਪੱਕਣ (ਰਾਈਪਨਿੰਗ)

source: During the grain maturation stage, rice grains transition from a milky consistency to a doughy state and eventually harden into fully mature grains. This stage is marked by the transfer of photosynthates from the plant's leaves and stems into the developing grains, supporting their growth and filling. As maturation progresses, the grain color shifts from green to a golden yellow, indicating readiness for harvest. Water supply is gradually reduced during this phase to aid in the drying and hardening of the grains. The duration of this stage is typically around 25 to 30 days. Timely harvesting is essential to prevent grain shattering and minimize losses. Ideally, the grain moisture content at harvest should be between 20–25%%. Additionally, protection from pests such as rice bugs and birds is important to maintain grain quality and prevent damage.
pa: ਅਨਾਜ ਪੱਕਣ ਦੇ ਪੜਾਅ ਦੌਰਾਨ, ਚੌਲ ਦੇ ਦਾਣੇ ਦੁੱਧੀ ਹਾਲਤ ਤੋਂ ਗੁੰਦੇ ਵਰਗੇ ਹੋ ਜਾਂਦੇ ਹਨ ਅਤੇ ਆਖ਼ਰਕਾਰ ਪੂਰੀ ਤਰ੍ਹਾਂ ਪੱਕ ਜਾਂਦੇ ਹਨ। ਇਸ ਪੜਾਅ ਵਿੱਚ ਪੌਦੇ ਦੇ ਪੱਤਿਆਂ ਅਤੇ ਤਣਿਆਂ ਤੋਂ ਬਣੇ ਫੋਟੋਸਿੰਥੇਟ ਅਨਾਜ ਵਿੱਚ ਚਲੇ ਜਾਂਦੇ ਹਨ, ਜਿਸ ਨਾਲ ਉਹ ਭਰਦੇ ਅਤੇ ਵਧਦੇ ਹਨ। ਜਿਵੇਂ-ਜਿਵੇਂ ਪੱਕਣ ਵਧਦੀ ਹੈ, ਅਨਾਜ ਦਾ ਰੰਗ ਹਰਾ ਤੋਂ ਸੁਨਹਿਰੀ ਪੀਲਾ ਹੋ ਜਾਂਦਾ ਹੈ, ਜੋ ਕਿ ਕਟਾਈ ਲਈ ਤਿਆਰੀ ਦਰਸਾਉਂਦਾ ਹੈ। ਇਸ ਪੜਾਅ ਦੌਰਾਨ ਪਾਣੀ ਦੀ ਸਪਲਾਈ ਹੌਲੀ-ਹੌਲੀ ਘਟਾਈ ਜਾਂਦੀ ਹੈ ਤਾਂ ਜੋ ਅਨਾਜ ਸੁੱਕਣ ਅਤੇ ਪੱਕਣ ਵਿੱਚ ਆਸਾਨੀ ਹੋਵੇ। ਇਹ ਪੜਾਅ ਆਮ ਤੌਰ 'ਤੇ 25 ਤੋਂ 30 ਦਿਨ ਚਲਦਾ ਹੈ। ਸਮੇਂ-ਸਿਰ ਕਟਾਈ ਕਰਨਾ ਅਨਾਜ ਦੇ ਟੁੱਟਣ ਅਤੇ ਨੁਕਸਾਨ ਤੋਂ ਬਚਾਉਣ ਲਈ ਜ਼ਰੂਰੀ ਹੈ। ਆਦਰਸ਼ ਤੌਰ 'ਤੇ, ਕਟਾਈ ਸਮੇਂ ਅਨਾਜ ਵਿੱਚ ਨਮੀ 20–25%% ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ। ਇਸਦੇ ਨਾਲ, ਚੌਲ ਦੇ ਕੀੜਿਆਂ ਅਤੇ ਪੰਛੀਆਂ ਤੋਂ ਰੱਖਿਆ ਕਰਨੀ ਵੀ ਅਨਾਜ ਦੀ ਗੁਣਵੱਤਾ ਬਣਾਈ ਰੱਖਣ ਅਤੇ ਨੁਕਸਾਨ ਤੋਂ ਬਚਣ ਲਈ ਮਹੱਤਵਪੂਰਨ ਹੈ।

source: Transplanting Rice (TPR) Timeline – Punjab Agriculture
pa: ਚੌਲ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ (TPR) ਟਾਈਮਲਾਈਨ – ਪੰਜਾਬ ਖੇਤੀਬਾੜੀ

source: Transplanting Rice (TPR) Timeline
pa: ਚੌਲ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ (TPR) ਟਾਈਮਲਾਈਨ

source: Step-by-step process of the traditional Transplanting Rice method, widely practiced in Punjab for high-yield rice cultivation.
pa: ਚੌਲ ਦੀ ਉੱਚ ਪੈਦਾਵਾਰ ਲਈ ਪੰਜਾਬ ਵਿੱਚ ਵਿਆਪਕ ਵਰਤੇ ਜਾਂਦੇ ਰਵਾਇਤੀ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਤਰੀਕੇ ਦੀ ਕਦਮ-ਦਰ-ਕਦਮ ਪ੍ਰਕਿਰਿਆ।

source: Transplanting Rice (TPR) Method – Step-by-Step Timeline
pa: ਚੌਲ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ (TPR) ਤਰੀਕਾ – ਕਦਮ-ਦਰ-ਕਦਮ ਟਾਈਮਲਾਈਨ

source: Nursery Preparation
pa: ਨਰਸਰੀ ਤਿਆਰੀ

source: Rice seeds are densely sown in a separate nursery bed and grown for 25–35 days. Manual sowing ensures a small nursery can serve a larger field.
pa: ਚੌਲ ਦੇ ਬੀਜ ਵੱਖਰੀ ਨਰਸਰੀ ਵਿੱਚ ਘਣੇ ਬੀਜੇ ਜਾਂਦੇ ਹਨ ਅਤੇ 25–35 ਦਿਨ ਲਈ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ਹੱਥੋਂ ਬਿਜਾਈ ਨਾਲ ਛੋਟੀ ਨਰਸਰੀ ਵੱਡੇ ਖੇਤ ਲਈ ਕਾਫੀ ਹੁੰਦੀ ਹੈ।

source: Seedlings develop in the nursery for about 4 weeks, reaching optimal age and height for transplanting.
pa: ਪੁੱਗੀਆਂ ਲਗਭਗ 4 ਹਫ਼ਤੇ ਨਰਸਰੀ ਵਿੱਚ ਉਗਦੀਆਂ ਹਨ, ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਲਈ ਉਚਿਤ ਉਮਰ ਅਤੇ ਉਚਾਈ 'ਤੇ ਪਹੁੰਚਦੀਆਂ ਹਨ।

source: Seedlings are manually uprooted and transplanted into puddled fields in rows, requiring significant labor for optimal spacing.
pa: ਪੁੱਗੀਆਂ ਹੱਥੋਂ ਉਖਾੜ ਕੇ ਪਾਣੀ ਵਾਲੇ ਖੇਤ ਵਿੱਚ ਕਤਾਰਾਂ ਵਿੱਚ ਲਾਈਆਂ ਜਾਂਦੀਆਂ ਹਨ, ਜਿਸ ਲਈ ਵਧੇਰੇ ਮਜ਼ਦੂਰੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ।

source: Water Management
pa: ਪਾਣੀ ਪ੍ਰਬੰਧਨ

source: After transplanting, fields are kept flooded with a few centimeters of water to suppress weeds and provide ideal conditions for rice growth.
pa: ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਤੋਂ ਬਾਅਦ, ਖੇਤ ਵਿੱਚ ਕੁਝ ਸੈਂਟੀਮੀਟਰ ਪਾਣੀ ਰੱਖਿਆ ਜਾਂਦਾ ਹੈ ਤਾਂ ਜੋ ਘਾਹ ਦਬੇ ਰਹਿਣ ਅਤੇ ਚੌਲ ਦੀ ਵਾਧੂ ਲਈ ਵਧੀਆ ਹਾਲਾਤ ਬਣ ਸਕਣ।

source: Tube-well System: Key Components
pa: ਟਿਊਬ-ਵੈਲ ਪ੍ਰਣਾਲੀ: ਮੁੱਖ ਭਾਗ

source: Explore the main parts of a tube-well irrigation system in Punjab. Scroll horizontally or use the navigation buttons to learn about each component, view images and watch videos of real installations.
pa: ਪੰਜਾਬ ਵਿੱਚ ਟਿਊਬ-ਵੈਲ ਸਿੰਚਾਈ ਪ੍ਰਣਾਲੀ ਦੇ ਮੁੱਖ ਭਾਗਾਂ ਨੂੰ ਵੇਖੋ। ਹਰ ਹਿੱਸੇ ਬਾਰੇ ਜਾਣਨ ਲਈ ਹੋਰਿਜ਼ਾਂਟਲ ਸਕ੍ਰੋਲ ਕਰੋ ਜਾਂ ਨੇਵੀਗੇਸ਼ਨ ਬਟਨ ਵਰਤੋ, ਤਸਵੀਰਾਂ ਵੇਖੋ ਅਤੇ ਅਸਲ ਇੰਸਟਾਲੇਸ਼ਨਾਂ ਦੇ ਵੀਡੀਓ ਵੀ ਦੇਖੋ।

source: Previous
pa: ਪਿਛਲਾ

source: Bore-well drilling
pa: ਬੋਰ-ਵੈਲ ਖੋਦਣਾ

source: Bore-well (Tube-well)
pa: ਬੋਰ-ਵੈਲ (ਟਿਊਬ-ਵੈਲ)

source: A deep, narrow tube-shaped bore (3–6" diameter) drilled 100–400 ft below ground, typically around 200 ft. It accesses the underground aquifer for irrigation.
pa: ਇਹ ਇਕ 3–6 ਇੰਚ ਵਿਆਸ ਵਾਲੀ ਗਹਿਰੀ ਅਤੇ ਸੱਥੀ ਟਿਊਬ ਆਕਾਰ ਦੀ ਬੋਰ ਹੁੰਦੀ ਹੈ ਜੋ ਧਰਤੀ ਤੋਂ 100–400 ਫੁੱਟ ਹੇਠਾਂ ਤੱਕ ਖੋਦੀ ਜਾਂਦੀ ਹੈ (ਸਧਾਰਨ ਤੌਰ 'ਤੇ 200 ਫੁੱਟ)। ਇਹ ਸਿੰਚਾਈ ਲਈ ਭੂਜਲ ਸਰੋਤ ਤੱਕ ਪਹੁੰਚ ਦਿੰਦੀ ਹੈ।

source: Typical cost: ₹3–6 lakhs<br> Depth: 100–400 ft
pa: ਆਮ ਲਾਗਤ: ₹3–6 ਲੱਖ<br> ਗਹਿਰਾਈ: 100–400 ਫੁੱਟ

source: Drivery iron pipe
pa: ਡ੍ਰਾਈਵਰੀ ਆਇਰਨ ਪਾਈਪ

source: Drivery Iron Pipe
pa: ਡ੍ਰਾਈਵਰੀ ਆਇਰਨ ਪਾਈਪ

source: An iron pipe inserted into the bore, reaching the water level. The pump is attached to this pipe, placed 20 ft below the water level to avoid sand intake.
pa: ਇਹ ਆਇਰਨ ਦੀ ਪਾਈਪ ਹੁੰਦੀ ਹੈ ਜੋ ਬੋਰ ਵਿੱਚ ਪਾਣੀ ਦੀ ਸਤਰ ਤੱਕ ਪਹੁੰਚਦੀ ਹੈ। ਪੰਪ ਇਸ ਪਾਈਪ ਨਾਲ ਜੁੜਿਆ ਹੋਇਆ ਹੁੰਦਾ ਹੈ ਅਤੇ ਪਾਣੀ ਦੀ ਸਤਰ ਤੋਂ 20 ਫੁੱਟ ਹੇਠਾਂ ਲਗਾਇਆ ਜਾਂਦਾ ਹੈ ਤਾਂ ਜੋ ਰੇਤ ਅੰਦਰ ਨਾ ਆਵੇ।

source: Diameter: 3–6"<br> Placement: 20 ft below water
pa: ਵਿਆਸ: 3–6 ਇੰਚ<br> ਸਥਾਪਨਾ: ਪਾਣੀ ਤੋਂ 20 ਫੁੱਟ ਹੇਠਾਂ

source: Motor Pump
pa: ਮੋਟਰ ਪੰਪ

source: A powerful electric pump (12.5–25 hp) extracts water from the aquifer. The pump and pipe are lowered as the water table drops.
pa: ਇਹ ਇੱਕ ਤਾਕਤਵਰ ਬਿਜਲੀ ਵਾਲਾ ਪੰਪ ਹੁੰਦਾ ਹੈ (12.5–25 ਐਚਪੀ) ਜੋ ਭੂਜਲ ਸਰੋਤ ਤੋਂ ਪਾਣੀ ਚੁੱਕਦਾ ਹੈ। ਜਿਵੇਂ-ਜਿਵੇਂ ਪਾਣੀ ਦੀ ਸਤਰ ਘਟਦੀ ਹੈ, ਪੰਪ ਅਤੇ ਪਾਈਪ ਨੂੰ ਹੇਠਾਂ ਕਰਨਾ ਪੈਂਦਾ ਹੈ।

source: Power: 12.5–25 hp<br> Adjustment cost: ₹5,000–10,000
pa: ਤਾਕਤ: 12.5–25 ਐਚਪੀ<br> ਠੀਕ ਕਰਨ ਦੀ ਲਾਗਤ: ₹5,000–10,000

source: Delivery pipe and pool
pa: ਡਿਲਿਵਰੀ ਪਾਈਪ ਅਤੇ ਟੈਂਕ

source: Delivery Pipe & Pool
pa: ਡਿਲਿਵਰੀ ਪਾਈਪ ਅਤੇ ਟੈਂਕ

source: Water is brought to the surface via a 3–4" curved delivery pipe, leading to a small cemented pool (usually 2x2 m) that funnels water for distribution.
pa: ਇਹ 3–4 ਇੰਚ ਚੌੜੀ ਮੋੜੀ ਹੋਈ ਡਿਲਿਵਰੀ ਪਾਈਪ ਰਾਹੀਂ ਪਾਣੀ ਨੂੰ ਜ਼ਮੀਨ ਉੱਤੇ ਲਿਆਉਂਦਾ ਹੈ ਜੋ ਕਿ ਇੱਕ ਛੋਟੇ ਸੀਮੈਂਟ ਦੇ ਟੈਂਕ (ਸਧਾਰਨ ਤੌਰ 'ਤੇ 2x2 ਮੀਟਰ) ਵਿੱਚ ਜਾਂਦਾ ਹੈ, ਜਿੱਥੋਂ ਪਾਣੀ ਵੰਡਿਆ ਜਾਂਦਾ ਹੈ।

source: Pipe diameter: 3–4"<br> Pool size: up to 2x2 m
pa: ਪਾਈਪ ਚੌੜਾਈ: 3–4 ਇੰਚ<br> ਟੈਂਕ ਦਾ ਆਕਾਰ: ਲਗਭਗ 2x2 ਮੀਟਰ

source: Open air irrigation canal
pa: ਖੁੱਲ੍ਹਾ ਸਿੰਚਾਈ ਨਾਲਾ

source: Water Distribution
pa: ਪਾਣੀ ਵੰਡ ਪ੍ਰਣਾਲੀ

source: Water is distributed from the pool to fields, mostly via open-air canals and, in some farms, underground piping.
pa: ਟੈਂਕ ਤੋਂ ਪਾਣੀ ਖੇਤਾਂ ਤੱਕ ਖੁੱਲ੍ਹੇ ਨਾਲਿਆਂ ਰਾਹੀਂ ਵੰਡਿਆ ਜਾਂਦਾ ਹੈ, ਤੇ ਕੁਝ ਫਾਰਮਾਂ ਵਿੱਚ ਅੰਡਰਗਰਾਊਂਡ ਪਾਈਪਿੰਗ ਵੀ ਵਰਤੀ ਜਾਂਦੀ ਹੈ।

source: Main method: Open-air canals<br> Alternative: Underground pipes
pa: ਮੁੱਖ ਤਰੀਕਾ: ਖੁੱਲ੍ਹੇ ਨਾਲੇ<br> ਵਿਕਲਪ: ਅੰਡਰਗਰਾਊਂਡ ਪਾਈਪਾਂ

source: Next
pa: ਅੱਗੇ
