Repository: DigitalVillage-TIET/Digi-Portal
Catalog: digivi/locale/*/LC_MESSAGES/django.po
Languages: pa

source: Punjab Agriculture Overview
pa: ਪੰਜਾਬ ਖੇਤੀਬਾੜੀ ਦਾ ਸਰਵੇਖਣ

source: Toggle theme
pa: ਥੀਮ ਬਦਲੋ

source: Punjab: The Granary of India
pa: ਪੰਜਾਬ: ਭਾਰਤ ਦਾ ਅੰਨ ਭੰਡਾਰ

source: Despite covering only 1.5%% of India's land area, Punjab plays a critical role in food grain production due to its wheat-rice cropping system and the impact of the Green Revolution.
pa: ਭਾਵੇਂ ਪੰਜਾਬ ਭਾਰਤ ਦੀ ਜ਼ਮੀਨ ਦੇ ਕੇਵਲ 1.5%% ਹਿੱਸੇ 'ਤੇ ਫੈਲਿਆ ਹੋਇਆ ਹੈ, ਪਰ ਇਹ ਆਪਣੇ ਗੰਢਮ-ਚੌਲ ਦੀ ਫਸਲ ਚੱਕਰ ਅਤੇ ਹਰੀ ਕ੍ਰਾਂਤੀ ਦੇ ਪ੍ਰਭਾਵ ਕਾਰਨ ਅਨਾਜ ਉਤਪਾਦਨ ਵਿੱਚ ਅਹੰਕਾਰਪੂਰਕ ਭੂਮਿਕਾ ਨਿਭਾਉਂਦਾ ਹੈ।

source: 🌾 Agricultural Significance
pa: 🌾 ਖੇਤੀਬਾੜੀ ਦੀ ਮਹੱਤਤਾ

source: Covers only 1.5%% of India's land area
pa: ਭਾਰਤ ਦੀ ਜ਼ਮੀਨ ਦੇ ਕੇਵਲ 1.5%% ਹਿੱਸੇ 'ਤੇ ਫੈਲਿਆ

source: Major contributor to national food security
pa: ਦੇਸ਼ ਦੀ ਖਾਦ ਸੁਰੱਖਿਆ ਵਿੱਚ ਮੁੱਖ ਯੋਗਦਾਨੀ

source: Green Revolution success story
pa: ਹਰੀ ਕ੍ਰਾਂਤੀ ਦੀ ਸਫਲਤਾ ਕਹਾਣੀ

source: Punjab Agriculture
pa: ਪੰਜਾਬ ਖੇਤੀਬਾੜੀ

source: The Wheat-Rice Cropping Cycle
pa: ਗੰਢਮ-ਚੌਲ ਦੀ ਫਸਲ ਚੱਕਰ

source: This dual-crop system brings productivity but also major environmental concerns.
pa: ਇਹ ਦੋਹਰੀ ਫਸਲ ਪ੍ਰਣਾਲੀ ਉਤਪਾਦਕਤਾ ਲਿਆਉਂਦੀ ਹੈ ਪਰ ਨਾਲ ਹੀ ਵੱਡੀਆਂ ਵਾਤਾਵਰਣੀ ਚੁਣੌਤੀਆਂ ਵੀ ਲਿਆਉਂਦੀ ਹੈ।

source: 🌾 Rice Cultivation (Kharif: June–October)
pa: 🌾 ਚੌਲ ਦੀ ਖੇਤੀ (ਖਰੀਫ਼: ਜੂਨ–ਅਕਤੂਬਰ)

source: TPR – traditional, water-intensive
pa: ਟੀਪੀਆਰ – ਪਾਰੰਪਰਿਕ, ਪਾਣੀ-ਵਧੀਕ

source: DSR – emerging, water-saving
pa: ਡੀਐਸਆਰ – ਨਵੀਂ, ਪਾਣੀ-ਬਚਾਉਣ ਵਾਲੀ

source: Basmati exports across the globe
pa: ਬਾਸਮਤੀ ਚੌਲ ਦੀ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਨਿਰਯਾਤ

source: Rice Field
pa: ਚੌਲ ਦਾ ਖੇਤ

source: 🌾 Wheat Cultivation (Rabi: Nov–April)
pa: 🌾 ਕਣਕ ਦੀ ਖੇਤੀ (ਰਬੀ: ਨਵੰਬਰ–ਅਪ੍ਰੈਲ)

source: Mechanized tools & HYVs
pa: ਮਕੈਨੀਕਲ ਸਾਧਨ ਤੇ ਉੱਚ ਉਪਜ ਵਾਲੀਆਂ ਕਿਸਮਾਂ

source: Essential to national buffer stocks
pa: ਦੇਸ਼ ਦੇ ਬਫਰ ਸਟਾਕ ਲਈ ਜ਼ਰੂਰੀ

source: Ensures food security for millions
pa: ਲੱਖਾਂ ਲੋਕਾਂ ਲਈ ਖਾਦ ਸੁਰੱਖਿਆ ਯਕੀਨੀ ਬਣਾਉਂਦੀ ਹੈ

source: Wheat Field
pa: ਕਣਕ ਦਾ ਖੇਤ

source: MSP – Minimum Support Price
pa: ਦੇਸ਼ ਦੇ ਬਫਰ ਸਟਾਕ ਲਈ ਜ਼ਰੂਰੀ

source: The government ensures a minimum price (₹2,000–₹2,700 per quintal), giving farmers financial security and predictable income.
pa: ਸਰਕਾਰ ਘੱਟੋ-ਘੱਟ ਮੁੱਲ (₹2,000–₹2,700 ਪ੍ਰਤੀ ਕੁਇੰਟਲ) ਯਕੀਨੀ ਬਣਾਉਂਦੀ ਹੈ, ਜਿਸ ਨਾਲ ਕਿਸਾਨਾਂ ਨੂੰ ਆਰਥਿਕ ਸੁਰੱਖਿਆ ਅਤੇ ਨਿਸ਼ਚਿਤ ਆਮਦਨ ਮਿਲਦੀ ਹੈ।

source: Impact of the Wheat-Rice Cycle
pa: ਗੰਢਮ-ਚੌਲ ਚੱਕਰ ਦਾ ਪ੍ਰਭਾਵ

source: ✅ Advantages
pa: ✅ ਫਾਇਦੇ

source: High productivity + surplus
pa: ਉੱਚ ਉਤਪਾਦਨ ਅਤੇ ਵਾਧੂ ਉਤਪਾਦਨ

source: Government procurement assures income
pa: ਸਰਕਾਰੀ ਖਰੀਦ ਆਮਦਨ ਦੀ ਗਾਰੰਟੀ ਦਿੰਦੀ ਹੈ

source: Efficiency through machinery
pa: ਮਸ਼ੀਨਰੀ ਰਾਹੀਂ ਕਾਰਗੁਜ਼ਾਰੀ

source: ⚠️ Disadvantages
pa: ⚠️ ਨੁਕਸਾਨ

source: Groundwater depletion
pa: ਭੂਜਲ ਦੀ ਘਟਾਓ

source: Soil degradation
pa: ਮਿੱਟੀ ਦੀ ਗੁਣਵੱਤਾ ਵਿੱਚ ਕਮੀ

source: Air pollution via stubble burning
pa: ਪਰਾਲੀ ਸਾੜਨ ਕਾਰਨ ਹਵਾ ਪ੍ਰਦੂਸ਼ਣ

source: Climate change vulnerability
pa: ਮੌਸਮੀ ਤਬਦੀਲੀ ਦੀ ਸੰਵੇਦਨਸ਼ੀਲਤਾ

source: Crop Residue Management and Pre-Rabi Field Preparation
pa: ਫਸਲ ਦੇ ਬਚੇ ਹੋਏ ਅੰਗਾਂ ਦੀ ਸੰਭਾਲ ਅਤੇ ਰਬੀ ਤੋਂ ਪਹਿਲਾਂ ਖੇਤ ਦੀ ਤਿਆਰੀ

source: At the end of the rice season farmers use the combine to harvest rice, this leaves hard stubbles at the root of the plant projecting 10–15 cm above surface level. Thereafter, farmers will plough the field with a reaper to cut these stubbles leaving behind straw. This straw needs to be cleared so the land can be ready for the next crop's seeding. The most typical way of doing so is by burning it. However, due to its negative externalities the government is imposing a ₹2,500 per acre fine, prompting farmers to look into ways to eschew burning. Moreover, discouraging farmers from admitting the offense of burning.
pa: ਚੌਲ ਦੇ ਮੌਸਮ ਦੇ ਅੰਤ 'ਤੇ ਕਿਸਾਨ ਕਾਂਬਾਈਨ ਨਾਲ ਚੌਲ ਦੀ ਕਟਾਈ ਕਰਦੇ ਹਨ, ਜਿਸ ਨਾਲ ਪੌਦੇ ਦੀ ਜੜ੍ਹ 'ਤੇ 10-15 ਸੈਂਟੀਮੀਟਰ ਉੱਚੀਆਂ ਸਖ਼ਤ ਡੰਡੀਆਂ ਰਹਿ ਜਾਂਦੀਆਂ ਹਨ। ਇਸ ਤੋਂ ਬਾਅਦ, ਕਿਸਾਨ ਰੀਪਰ ਨਾਲ ਖੇਤ ਨੂੰ ਜੋਤਦੇ ਹਨ ਤਾਂ ਜੋ ਇਹ ਡੰਡੀਆਂ ਕੱਟੀਆਂ ਜਾ ਸਕਣ ਅਤੇ ਪਰਾਲੀ ਪਿੱਛੇ ਰਹਿ ਜਾਂਦੀ ਹੈ। ਇਹ ਪਰਾਲੀ ਹਟਾਉਣੀ ਲਾਜ਼ਮੀ ਹੈ ਤਾਂ ਜੋ ਅਗਲੀ ਫਸਲ ਦੀ ਬਿਜਾਈ ਲਈ ਖੇਤ ਤਿਆਰ ਹੋ ਸਕੇ। ਆਮ ਤੌਰ 'ਤੇ, ਇਸਨੂੰ ਸਾੜ ਕੇ ਹਟਾਇਆ ਜਾਂਦਾ ਹੈ। ਪਰ, ਇਸ ਦੇ ਨੁਕਸਾਨਦਾਇਕ ਪ੍ਰਭਾਵਾਂ ਕਰਕੇ ਸਰਕਾਰ 2,500 ਰੁਪਏ ਪ੍ਰਤੀ ਏਕੜ ਜੁਰਮਾਨਾ ਲਗਾ ਰਹੀ ਹੈ, ਜਿਸ ਕਾਰਨ ਕਿਸਾਨ ਸਾੜਨ ਤੋਂ ਬਚਣ ਦੇ ਤਰੀਕੇ ਲੱਭ ਰਹੇ ਹਨ ਅਤੇ ਸਾੜਨ ਦੀ ਗਲ ਕਰਨ ਤੋਂ ਵੀ ਕਤਰਾਉਂਦੇ ਹਨ।

source: Pre-Rabi Crop Preparation
pa: ਰਬੀ ਤੋਂ ਪਹਿਲਾਂ ਫਸਲ ਦੀ ਤਿਆਰੀ

source: Combine Harvesting
pa: ਕੰਬਾਈਨ ਨਾਲ ਕਟਾਈ

source: Sowing
pa: ਬਿਜਾਈ

source: Straw Management
pa: ਪਰਾਲੀ ਪ੍ਰਬੰਧਨ

source: Detailed Process Overview
pa: ਤਫਸੀਲ ਨਾਲ ਪ੍ਰਕਿਰਿਆ ਦਾ ਵੇਰਵਾ

source: A combine harvester simultaneously cuts, threshes, and cleans paddy...
pa: ਕੰਬਾਈਨ ਹਾਰਵੇਸਟਰ ਇਕੋ ਵਾਰੀ ਚੌਲ ਦੀ ਕਟਾਈ, ਥ੍ਰੈਸ਼ਿੰਗ ਅਤੇ ਸਫਾਈ ਕਰਦਾ ਹੈ...

source: During combine harvesting, the machine cuts, threshes, and cleans the rice in a single pass. There are two modes of operation: 1. Without a chopper: This leaves behind tall stubbles (10–15 cm) and large amounts of straw spread across the field. These stubbles remain firmly rooted and cannot be left unmanaged. 2. With a chopper attachment: The stubbles are chopped down further, reducing their height to 0–5 cm. While this helps partially manage the residue, a significant layer of straw still remains on the surface. In both cases, the field is left with a mixture of straw and standing stubble. If a chopper isn’t used, a follow-up pass with a reaper or cutter attachment is required to clear the land effectively before sowing the next crop.
pa: ਕੰਬਾਈਨ ਨਾਲ ਕਟਾਈ ਦੌਰਾਨ, ਮਸ਼ੀਨ ਇਕੋ ਵਾਰੀ ਚੌਲ ਦੀ ਕਟਾਈ, ਥ੍ਰੈਸ਼ਿੰਗ ਅਤੇ ਸਫਾਈ ਕਰਦੀ ਹੈ। ਇਸਦੀ ਦੋ ਤਰੀਕੇ ਹਨ: 1. ਚੌਪਰ ਤੋਂ ਬਿਨਾਂ: ਇਸ ਨਾਲ ਖੇਤ ਵਿੱਚ 10–15 ਸੈਂਟੀਮੀਟਰ ਉੱਚੀਆਂ ਡੰਡੀਆਂ ਅਤੇ ਵੱਡੀ ਮਾਤਰਾ ਵਿੱਚ ਪਰਾਲੀ ਰਹਿ ਜਾਂਦੀ ਹੈ। ਇਹ ਡੰਡੀਆਂ ਜਮੀਨ ਵਿੱਚ ਫੜੀ ਰਹਿੰਦੀਆਂ ਹਨ ਅਤੇ ਇਨ੍ਹਾਂ ਨੂੰ ਛੱਡਿਆ ਨਹੀਂ ਜਾ ਸਕਦਾ। 2. ਚੌਪਰ ਨਾਲ: ਡੰਡੀਆਂ ਹੋਰ ਛੋਟੀ (0–5 ਸੈਂਟੀਮੀਟਰ) ਕਰ ਦਿੱਤੀਆਂ ਜਾਂਦੀਆਂ ਹਨ। ਹਾਲਾਂਕਿ ਇਹ ਰੈਜ਼ੀਡੂ ਨੂੰ ਕੁਝ ਹੱਦ ਤੱਕ ਸੰਭਾਲਦਾ ਹੈ, ਪਰ ਖੇਤ ਵਿੱਚ ਪਰਾਲੀ ਦੀ ਪਰਤ ਫਿਰ ਵੀ ਰਹਿ ਜਾਂਦੀ ਹੈ। ਦੋਵੇਂ ਹਾਲਤਾਂ ਵਿੱਚ, ਖੇਤ ਵਿੱਚ ਪਰਾਲੀ ਅਤੇ ਖੜ੍ਹੀਆਂ ਡੰਡੀਆਂ ਮਿਲੀਆਂ ਰਹਿ ਜਾਂਦੀਆਂ ਹਨ। ਜੇ ਚੌਪਰ ਨਹੀਂ ਵਰਤਿਆ ਜਾਂਦਾ, ਤਾਂ ਅਗਲੀ ਫ਼ਸਲ ਦੀ ਬਿਜਾਈ ਤੋਂ ਪਹਿਲਾਂ ਰੀਪਰ ਜਾਂ ਕਟਰ ਨਾਲ ਖੇਤ ਦੀ ਸਫਾਈ ਲਾਜ਼ਮੀ ਹੈ।

source: Show more
pa: ਹੋਰ ਵੇਖੋ

source: Traditionally burned, straw is now managed through better alternatives...
pa: ਪਾਰੰਪਰਿਕ ਤੌਰ 'ਤੇ ਸਾੜੀ ਜਾਂਦੀ ਪਰਾਲੀ ਹੁਣ ਵਧੀਆ ਵਿਕਲਪਾਂ ਰਾਹੀਂ ਸੰਭਾਲੀ ਜਾਂਦੀ ਹੈ...

source: There are multiple ways to manage parali after harvesting: 1. Burning: Still common, farmers may burn the entire field, partially burn (leaving stubble), or burn straw only and manually remove remaining stubble. 2. Baling: Implements collect straw into bales for sale or disposal. This requires transport and often incurs rental costs (₹500/acre), making it less viable for many farmers. 3. Plowing Methods:
pa: ਕਟਾਈ ਤੋਂ ਬਾਅਦ ਪਰਾਲੀ ਸੰਭਾਲਣ ਦੇ ਕਈ ਤਰੀਕੇ ਹਨ: 1. ਸਾੜਨਾ: ਅਜੇ ਵੀ ਆਮ ਹੈ, ਕਿਸਾਨ ਪੂਰਾ ਖੇਤ ਸਾੜ ਸਕਦੇ ਹਨ, ਹਿੱਸਾ-ਵਾਰ ਸਾੜਦੇ ਹਨ (ਡੰਡੀਆਂ ਛੱਡ ਕੇ), ਜਾਂ ਸਿਰਫ਼ ਪਰਾਲੀ ਸਾੜ ਕੇ ਬਾਕੀ ਡੰਡੀਆਂ ਹੱਥੋਂ ਹਟਾਉਂਦੇ ਹਨ। 2. ਗੱਠ ਬਣਾਉਣਾ: ਮਸ਼ੀਨਾਂ ਪਰਾਲੀ ਨੂੰ ਗੱਠਾਂ ਵਿੱਚ ਇਕੱਠਾ ਕਰਦੀਆਂ ਹਨ, ਜੋ ਵੇਚਣ ਜਾਂ ਨਸ਼ਟ ਕਰਨ ਲਈ ਵਰਤੀਆਂ ਜਾਂਦੀਆਂ ਹਨ। ਇਸ ਲਈ ਆਵਾਜਾਈ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ ਅਤੇ ਅਕਸਰ ਕਿਰਾਏ ਦੀ ਲਾਗਤ (₹500/ਏਕੜ) ਆਉਂਦੀ ਹੈ, ਜਿਸ ਕਰਕੇ ਬਹੁਤ ਸਾਰੇ ਕਿਸਾਨਾਂ ਲਈ ਇਹ ਘੱਟ ਲਾਭਕਾਰੀ ਹੈ। 3. ਜੋਤਣ ਦੇ ਤਰੀਕੇ:

source: Mulcher + MB Plough:
pa: ਮਲਚਰ + ਐਮਬੀ ਪਲਾਊ:

source: Cuts straw, then buries it by flipping soil on top.
pa: ਪਰਾਲੀ ਕੱਟ ਕੇ ਮਿੱਟੀ ਹੇਠਾਂ ਦਬਾਉਂਦੇ ਹਨ।

source: Rotavator:
pa: ਰੋਟਾਵੇਟਰ:

source: Mixes straw into the soil; often used with Super Seeder.
pa: ਪਰਾਲੀ ਨੂੰ ਮਿੱਟੀ ਵਿੱਚ ਮਿਲਾਉਂਦਾ ਹੈ; ਅਕਸਰ ਸੁਪਰ ਸੀਡਰ ਨਾਲ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ।

source: Super Seeder:
pa: ਸੁਪਰ ਸੀਡਰ:

source: Simultaneously ploughs and sows wheat. Effective for hard soils but requires a high-HP tractor.
pa: ਇਕੋ ਸਮੇਂ ਜੋਤ ਅਤੇ ਗੰਢਮ ਦੀ ਬਿਜਾਈ। ਸਖ਼ਤ ਮਿੱਟੀ ਲਈ ਵਧੀਆ, ਪਰ ਵੱਧ ਐਚਪੀ ਵਾਲਾ ਟਰੈਕਟਰ ਚਾਹੀਦਾ ਹੈ।

source: Once the land is cleared of straw, sowing begins using different methods...
pa: ਜਦੋਂ ਪਰਾਲੀ ਹਟਾ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ, ਤਾਂ ਖੇਤ ਵਿੱਚ ਵੱਖ-ਵੱਖ ਤਰੀਕਿਆਂ ਨਾਲ ਬਿਜਾਈ ਸ਼ੁਰੂ ਹੁੰਦੀ ਹੈ...

source: After the field is cleared of straw and stubble, the next step is sowing wheat: 1. Super Seeder / Happy Seeder: These combine residue management and sowing in a single operation. They place seeds directly into the soil through the straw, saving time and labor. 2. Seed Drill (Most common): Traditional method used after clearing the field. It creates rows, ensures consistent seed depth, and improves germination. In high-residue fields, using a seed drill along with earlier ploughing (rotavator or mulcher) ensures better seed-to-soil contact and uniform crop growth.
pa: ਜਦੋਂ ਖੇਤ ਤੋਂ ਪਰਾਲੀ ਅਤੇ ਡੰਡੀਆਂ ਹਟਾ ਦਿੱਤੀਆਂ ਜਾਂਦੀਆਂ ਹਨ, ਤਾਂ ਅਗਲਾ ਕਦਮ ਗੰਢਮ ਦੀ ਬਿਜਾਈ ਹੈ: 1. ਸੁਪਰ ਸੀਡਰ / ਹੈਪੀ ਸੀਡਰ: ਇਹ ਮਸ਼ੀਨਾਂ ਇਕੋ ਸਮੇਂ ਪਰਾਲੀ ਪ੍ਰਬੰਧਨ ਅਤੇ ਬਿਜਾਈ ਕਰਦੀਆਂ ਹਨ। ਇਹ ਬੀਜਾਂ ਨੂੰ ਪਰਾਲੀ ਰਾਹੀਂ ਸਿੱਧਾ ਮਿੱਟੀ ਵਿੱਚ ਪਾ ਦਿੰਦੀਆਂ ਹਨ, ਜਿਸ ਨਾਲ ਸਮਾਂ ਅਤੇ ਮਜ਼ਦੂਰੀ ਬਚਦੀ ਹੈ। 2. ਸੀਡ ਡ੍ਰਿਲ (ਸਭ ਤੋਂ ਆਮ): ਇਹ ਰਵਾਇਤੀ ਤਰੀਕਾ ਹੈ ਜੋ ਖੇਤ ਸਾਫ਼ ਕਰਨ ਤੋਂ ਬਾਅਦ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ। ਇਹ ਕਤਾਰਾਂ ਬਣਾਉਂਦੀ ਹੈ, ਬੀਜ ਦੀ ਗਹਿਰਾਈ ਇੱਕੋ ਜਿਹੀ ਰੱਖਦੀ ਹੈ ਅਤੇ ਅੰਕੁਰਣ ਵਿੱਚ ਸੁਧਾਰ ਕਰਦੀ ਹੈ। ਜਿੱਥੇ ਖੇਤ ਵਿੱਚ ਵੱਧ ਪਰਾਲੀ ਰਹਿ ਜਾਂਦੀ ਹੈ, ਉੱਥੇ ਪਹਿਲਾਂ ਰੋਟਾਵੇਟਰ ਜਾਂ ਮਲਚਰ ਨਾਲ ਜੋਤਣ ਤੋਂ ਬਾਅਦ ਸੀਡ ਡ੍ਰਿਲ ਵਰਤਣ ਨਾਲ ਬੀਜ ਅਤੇ ਮਿੱਟੀ ਦਾ ਸੰਪਰਕ ਵਧੀਆ ਹੁੰਦਾ ਹੈ ਅਤੇ ਫਸਲ ਇੱਕੋ ਜਿਹੀ ਉਗਦੀ ਹੈ।

source: 🌱 Direct Seeded Rice (DSR)
pa: 🌱 ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR)

source: Direct Seeded Rice (DSR) is an emerging and efficient alternative to the traditional rice transplanting method. Unlike conventional practices that involve raising seedlings in a nursery followed by manual transplantation, DSR allows farmers to sow rice seeds directly into the field using a tractor-mounted seeder. This eliminates the need for puddling and reduces dependency on labor and water.
pa: ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR) ਰਵਾਇਤੀ ਚੌਲ ਟ੍ਰਾਂਸਪਲੈਂਟਿੰਗ ਤਰੀਕੇ ਦਾ ਇੱਕ ਨਵਾਂ ਅਤੇ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਵਿਕਲਪ ਹੈ। ਪਾਰੰਪਰਿਕ ਤਰੀਕਿਆਂ ਵਿੱਚ ਨਰਸਰੀ ਵਿੱਚ ਪੁੱਗੀਆਂ ਉਗਾਈਆਂ ਜਾਂਦੀਆਂ ਹਨ ਅਤੇ ਫਿਰ ਹੱਥ ਨਾਲ ਟ੍ਰਾਂਸਪਲੈਂਟ ਕੀਤਾ ਜਾਂਦਾ ਹੈ, DSR ਵਿੱਚ ਕਿਸਾਨ ਟ੍ਰੈਕਟਰ-ਮਾਊਂਟਿਡ ਸੀਡਰ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਬੀਜਾਂ ਨੂੰ ਸਿੱਧਾ ਖੇਤ ਵਿੱਚ ਬੀਜ ਸਕਦੇ ਹਨ। ਇਸ ਨਾਲ ਪਡਲਿੰਗ ਦੀ ਲੋੜ ਨਹੀਂ ਰਹਿੰਦੀ ਅਤੇ ਮਜ਼ਦੂਰੀ ਅਤੇ ਪਾਣੀ ਦੀ ਲੋੜ ਘੱਟ ਹੁੰਦੀ ਹੈ।

source: Key Advantages:
pa: ਮੁੱਖ ਫਾਇਦੇ:

source: Significant water savings.
pa: ਪਾਣੀ ਦੀ ਮਹੱਤਵਪੂਰਨ ਬਚਤ।

source: Reduced labor requirements during peak agricultural seasons.
pa: ਖੇਤੀ ਦੇ ਚਰਮ ਸਮੇਂ ਮਜ਼ਦੂਰੀ ਦੀ ਘੱਟ ਲੋੜ।

source: Faster crop maturity and harvesting cycle.
pa: ਫਸਲ ਦੀ ਜਲਦੀ ਪੱਕਣ ਅਤੇ ਕਟਾਈ ਦਾ ਚੱਕਰ।

source: Notable Challenges:
pa: ਮੁੱਖ ਚੁਣੌਤੀਆਂ:

source: Requires effective weed management strategies.
pa: ਵਧੀਆ ਘਾਸ-ਨਿਯੰਤਰਣ ਨੀਤੀਆਂ ਦੀ ਲੋੜ।

source: Less suitable for sandy or porous soils due to moisture loss.
pa: ਰੇਤਲੀ ਜਾਂ ਛਿੱਟੀ ਮਿੱਟੀ ਲਈ ਘੱਟ ਉਚਿਤ, ਨਮੀ ਖੋਹ ਕਾਰਨ।

source: May lead to uneven seed germination if not managed carefully.
pa: ਧਿਆਨ ਨਾ ਦੇਣ ਤੇ ਬੀਜਾਂ ਦੀ ਅਸਮਾਨ ਉਗਾਉ ਹੋ ਸਕਦੀ ਹੈ।

source: In response to Punjab's escalating groundwater crisis, DSR is being actively promoted as a sustainable solution to rice cultivation. Since 2022, the state government has provided an incentive of ₹1,500 per acre to farmers adopting the DSR method. Verification is carried out through two field inspections during the crop’s germination stage. With increasing adoption, DSR is gradually becoming a standardized and systematic approach to rice farming in the region.
pa: ਪੰਜਾਬ ਵਿੱਚ ਵਧ ਰਹੀ ਭੂਜਲ ਸੰਕਟ ਦੇ ਜਵਾਬ ਵਿੱਚ, DSR ਨੂੰ ਚੌਲ ਦੀ ਖੇਤੀ ਲਈ ਇੱਕ ਟਿਕਾਊ ਹੱਲ ਵਜੋਂ ਪ੍ਰਚਾਰਿਤ ਕੀਤਾ ਜਾ ਰਿਹਾ ਹੈ। 2022 ਤੋਂ, ਸੂਬਾ ਸਰਕਾਰ ਨੇ DSR ਤਰੀਕੇ ਨੂੰ ਅਪਣਾਉਣ ਵਾਲੇ ਕਿਸਾਨਾਂ ਨੂੰ ਪ੍ਰਤੀ ਏਕੜ ₹1,500 ਦਾ ਪ੍ਰੋਤਸਾਹਨ ਦਿੱਤਾ ਹੈ। ਫਸਲ ਦੇ ਅੰਕੁਰਣ ਦੌਰਾਨ ਦੋ ਖੇਤੀ-ਜਾਂਚਾਂ ਰਾਹੀਂ ਪੁਸ਼ਟੀ ਕੀਤੀ ਜਾਂਦੀ ਹੈ। ਵਧ ਰਹੀ ਅਪਣਾਈ ਨਾਲ, DSR ਖੇਤਰ ਵਿੱਚ ਚੌਲ ਖੇਤੀ ਲਈ ਇੱਕ ਮਿਆਰੀ ਅਤੇ ਪ੍ਰਣਾਲੀਬੱਧ ਤਰੀਕਾ ਬਣ ਰਿਹਾ ਹੈ।

source: Direct Seeded Rice (DSR) Establishment Steps
pa: ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR) ਦੀ ਸਥਾਪਨਾ ਦੇ ਕਦਮ

source: Wet DSR
pa: ਗਿੱਲਾ DSR

source: Field is flooded in advance, seeds are sown after water recedes.
pa: ਖੇਤ ਪਹਿਲਾਂ ਭਰਿਆ ਜਾਂਦਾ ਹੈ, ਬੀਜ ਪਾਣੀ ਘਟਣ ਤੋਂ ਬਾਅਦ ਬਿਜੇ ਜਾਂਦੇ ਹਨ।

source: Dry DSR
pa: ਸੁੱਕਾ DSR

source: Seeds sown on dry soil, then irrigated for germination.
pa: ਬੀਜ ਸੁੱਕੀ ਮਿੱਟੀ 'ਤੇ ਬਿਜੇ ਜਾਂਦੇ ਹਨ, ਫਿਰ ਅੰਕੁਰਣ ਲਈ ਸਿੰਚਾਈ ਕੀਤੀ ਜਾਂਦੀ ਹੈ।

source: DSR Seeder
pa: DSR ਸੀਡਰ

source: Tractor-mounted seeder for direct sowing.
pa: ਟ੍ਰੈਕਟਰ-ਮਾਊਂਟਿਡ ਸੀਡਰ ਜੋ ਸਿੱਧਾ ਬੀਜਾਈ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ।

source: Germination
pa: ਅੰਕੁਰਣ

source: Seedlings emerge, 2–4 irrigations as needed.
pa: ਪੁੱਗੀਆਂ ਉਗਦੀਆਂ ਹਨ, ਲੋੜ ਅਨੁਸਾਰ 2–4 ਵਾਰੀ ਸਿੰਚਾਈ।

source: Watch: DSR Explained
pa: ਦੇਖੋ: DSR ਦੀ ਵਿਆਖਿਆ

source: A short explanation of Direct Seeded Rice (DSR) by Mr. Dan Etgar.
pa: ਮਿਸਟਰ ਡੈਨ ਐਟਗਾਰ ਵੱਲੋਂ ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR) ਦੀ ਛੋਟੀ ਵਿਆਖਿਆ।

source: DIGI-VI
pa: ਡਿਜੀ–ਵੀ

source: Evapotranspiration Analysis
pa: ਵਿਅਪੋਟ੍ਰਾਂਸਪਿਰੇਸ਼ਨ ਵਿਸ਼ਲੇਸ਼ਣ

source: Back to Templates
pa: ਟੈਂਪਲੇਟ ਤੇ ਵਾਪਸ

source: Advanced crop water requirement calculations using ET models, weather data, and soil moisture analytics for precision irrigation planning.
pa: ਉੱਨਤ ET ਮਾਡਲ, ਮੌਸਮੀ ਡੇਟਾ ਅਤੇ ਮਿੱਟੀ ਦੀ ਨਮੀ ਵਿਸ਼ਲੇਸ਼ਣ ਰਾਹੀਂ ਖੇਤੀ ਲਈ ਪਾਣੀ ਦੀ ਲੋੜ ਦੀ ਗਣਨਾ ਅਤੇ ਸੁਚੱਜੀ ਸਿੰਚਾਈ ਯੋਜਨਾ।

source: Under Development
pa: ਵਿਕਾਸ ਹੇਠ

source: Coming Soon: Advanced ET Analytics
pa: ਜਲਦੀ ਆ ਰਿਹਾ: ਉੱਨਤ ET ਵਿਸ਼ਲੇਸ਼ਣ

source: Weather Memory Challenge
pa: ਮੌਸਮ ਯਾਦ ਚੁਣੌਤੀ

source: Match the weather icons while we develop the ET analysis tool!
pa: ET ਵਿਸ਼ਲੇਸ਼ਣ ਸੰਦ ਬਣਾਉਂਦੇ ਹੋਏ ਮੌਸਮ ਦੇ ਆਇਕਨ ਮਿਲਾਓ!

source: Moves
pa: ਚਾਲਾਂ

source: Matches
pa: ਮਿਲਾਓ

source: Time
pa: ਸਮਾਂ

source: New Game
pa: ਨਵਾਂ ਖੇਡ

source: Reset
pa: ਰੀਸੈਟ

source: DIGI-VI Evapotranspiration Analysis • Development Preview
pa: ਡਿਜੀ-ਵੀ ਵਿਅਪੋਟ੍ਰਾਂਸਪਿਰੇਸ਼ਨ ਵਿਸ਼ਲੇਸ਼ਣ • ਵਿਕਾਸ ਝਲਕ

source: Home
pa: ਮੁੱਖ ਸਫ਼ਾ

source: Transforming Agriculture Through Innovation
pa: ਨਵੀਨਤਾ ਰਾਹੀਂ ਖੇਤੀਬਾੜੀ ਵਿੱਚ ਬਦਲਾਅ

source: Empowering Punjab's farmers with cutting-edge water-smart training programs and sustainable farming techniques
pa: ਪੰਜਾਬ ਦੇ ਕਿਸਾਨਾਂ ਨੂੰ ਪਾਣੀ-ਸਮਝਦਾਰ ਟ੍ਰੇਨਿੰਗ ਅਤੇ ਟਿਕਾਊ ਖੇਤੀ ਤਕਨੀਕਾਂ ਨਾਲ ਸਸ਼ਕਤ ਕਰਨਾ

source: Where traditional wisdom meets modern technology to create a sustainable future
pa: ਜਿੱਥੇ ਰਵਾਇਤੀ ਗਿਆਨ ਆਧੁਨਿਕ ਤਕਨੀਕ ਨਾਲ ਮਿਲਦਾ ਹੈ, ਟਿਕਾਊ ਭਵਿੱਖ ਬਣਾਉਣ ਲਈ

source: Alternate Wetting & Drying (AWD)
pa: ਬਦਲਵੇਂ ਢੰਗ ਨਾਲ ਗਿੱਲਾ ਕਰਨਾ ਅਤੇ ਸੁਕਾਉਣਾ (AWD)

source: Revolutionary water management technique that reduces water usage by up to 30%% while maintaining rice yields through strategic field drying cycles
pa: ਇਹ ਪਾਣੀ ਪ੍ਰਬੰਧਨ ਦੀ ਇਨਕਲਾਬੀ ਤਕਨੀਕ ਹੈ ਜੋ ਖੇਤ ਨੂੰ ਰਣਨੀਤਿਕ ਢੰਗ ਨਾਲ ਸੁਕਾ ਕੇ ਪਾਣੀ ਦੀ ਵਰਤੋਂ 30%% ਤੱਕ ਘਟਾਉਂਦੀ ਹੈ, ਅਤੇ ਚੌਲ ਦੀ ਪੈਦਾਵਾਰ ਬਣਾਈ ਰੱਖਦੀ ਹੈ।

source: Revolutionizing Water Management
pa: ਪਾਣੀ ਪ੍ਰਬੰਧਨ ਵਿੱਚ ਇਨਕਲਾਬ

source: To further promote water-saving practices in rice cultivation, we conducted a training session on Alternate Wetting and Drying (AWD), in collaboration with the International Rice Research Institute (IRRI). AWD is a proven technique that reduces water use by encouraging farmers to intermittently dry their fields rather than keeping them continuously flooded. The training focused on helping farmers understand how to manage water levels effectively—limiting the height of flooding and allowing the soil to partially dry before the next irrigation.
pa: ਚੌਲ ਦੀ ਖੇਤੀ ਵਿੱਚ ਪਾਣੀ-ਬਚਤ ਤਰੀਕਿਆਂ ਨੂੰ ਹੋਰ ਉਤਸ਼ਾਹਿਤ ਕਰਨ ਲਈ ਅਸੀਂ ਇੰਟਰਨੈਸ਼ਨਲ ਰਾਈਸ ਰਿਸਰਚ ਇੰਸਟੀਚਿਊਟ (IRRI) ਨਾਲ ਮਿਲ ਕੇ AWD (ਬਦਲਵੇਂ ਢੰਗ ਨਾਲ ਗਿੱਲਾ ਕਰਨਾ ਅਤੇ ਸੁਕਾਉਣਾ) 'ਤੇ ਟ੍ਰੇਨਿੰਗ ਸੈਸ਼ਨ ਕਰਵਾਇਆ। AWD ਇੱਕ ਸਾਬਤ ਤਕਨੀਕ ਹੈ ਜੋ ਕਿਸਾਨਾਂ ਨੂੰ ਲਗਾਤਾਰ ਪਾਣੀ ਭਰਨ ਦੀ ਬਜਾਏ ਖੇਤ ਨੂੰ ਕੁਝ ਸਮੇਂ ਲਈ ਸੁਕਾ ਕੇ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਘਟਾਉਣ ਲਈ ਉਤਸ਼ਾਹਿਤ ਕਰਦੀ ਹੈ। ਟ੍ਰੇਨਿੰਗ ਵਿੱਚ ਕਿਸਾਨਾਂ ਨੂੰ ਪਾਣੀ ਦੀ ਸਤਰ ਨੂੰ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਢੰਗ ਨਾਲ ਪ੍ਰਬੰਧਨ ਕਰਨ, ਪਾਣੀ ਦੀ ਉਚਾਈ ਸੀਮਤ ਕਰਨ ਅਤੇ ਅਗਲੀ ਸਿੰਚਾਈ ਤੋਂ ਪਹਿਲਾਂ ਮਿੱਟੀ ਨੂੰ ਕੁਝ ਹੱਦ ਤੱਕ ਸੁਕਣ ਦੇਣ ਬਾਰੇ ਜਾਣਕਾਰੀ ਦਿੱਤੀ।

source: This method marks a critical shift toward more sustainable rice farming. By reducing the frequency and intensity of irrigation, AWD helps lower groundwater extraction, which is urgently needed in Punjab, where overuse of groundwater poses a serious threat to long-term agricultural viability. Through our partnership with IRRI, we aim to build farmer capacity and awareness, equipping them with tools and knowledge to adapt to more water-efficient and climate-resilient farming systems.
pa: ਇਹ ਤਰੀਕਾ ਚੌਲ ਦੀ ਖੇਤੀ ਨੂੰ ਹੋਰ ਟਿਕਾਊ ਬਣਾਉਣ ਵੱਲ ਇੱਕ ਮਹੱਤਵਪੂਰਨ ਬਦਲਾਅ ਹੈ। ਸਿੰਚਾਈ ਦੀ ਵਾਰ-ਵਾਰਤਾ ਅਤੇ ਤੀਬਰਤਾ ਘਟਾ ਕੇ, AWD ਭੂਜਲ ਦੀ ਖਪਤ ਘਟਾਉਣ ਵਿੱਚ ਮਦਦ ਕਰਦੀ ਹੈ, ਜੋ ਕਿ ਪੰਜਾਬ ਵਿੱਚ ਲੰਬੇ ਸਮੇਂ ਲਈ ਖੇਤੀ ਦੀ ਟਿਕਾਊਤਾ ਲਈ ਬਹੁਤ ਜ਼ਰੂਰੀ ਹੈ। IRRI ਨਾਲ ਸਾਂਝਦਾਰੀ ਰਾਹੀਂ ਅਸੀਂ ਕਿਸਾਨਾਂ ਦੀ ਸਮਰੱਥਾ ਅਤੇ ਜਾਗਰੂਕਤਾ ਵਧਾਉਣ, ਉਨ੍ਹਾਂ ਨੂੰ ਪਾਣੀ-ਸਮਝਦਾਰ ਅਤੇ ਮੌਸਮ-ਸਹਿਣਸ਼ੀਲ ਖੇਤੀ ਪ੍ਰਣਾਲੀਆਂ ਲਈ ਸੰਦ ਅਤੇ ਗਿਆਨ ਦੇਣ ਦਾ ਲਕੜ ਰੱਖਦੇ ਹਾਂ।

source: Direct Seeded Rice (DSR) Workshop
pa: ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR) ਵਰਕਸ਼ਾਪ

source: Modern seeding technique that eliminates transplanting, reduces labor costs by 40%%, and promotes sustainable farming through efficient resource utilization
pa: ਇਹ ਆਧੁਨਿਕ ਬਿਜਾਈ ਤਕਨੀਕ ਹੈ ਜੋ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਦੀ ਲੋੜ ਖਤਮ ਕਰਦੀ ਹੈ, ਮਜ਼ਦੂਰੀ ਦੀ ਲਾਗਤ 40%% ਤੱਕ ਘਟਾਉਂਦੀ ਹੈ ਅਤੇ ਸਰੋਤਾਂ ਦੀ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਵਰਤੋਂ ਰਾਹੀਂ ਟਿਕਾਊ ਖੇਤੀ ਨੂੰ ਉਤਸ਼ਾਹਿਤ ਕਰਦੀ ਹੈ।

source: Pioneering Sustainable Rice Cultivation
pa: ਟਿਕਾਊ ਚੌਲ ਖੇਤੀ ਵਿੱਚ ਅਗਵਾਈ

source: <p>As part of our ongoing efforts to promote sustainable rice cultivation, we organized a Direct Seeded Rice (DSR) workshop for farmers in Punjab. The workshop introduced farmers to the DSR methodology, including key techniques and best practices for successful implementation. DSR offers a significant advantage over traditional transplanting methods by requiring less water and labor—two critical resources in Punjab’s agricultural landscape.</p> <p>However, the success of DSR depends on proper execution. One of the main challenges with DSR is the potential for increased weed pressure if not managed carefully. To address this, our training sessions emphasized weed management strategies and timely agronomic practices that ensure the method's effectiveness and long-term benefits.</p> <p>The workshop was conducted in collaboration with Punjab Agricultural University (PAU), our core partner in this project. As the leading rice research institution in the region, PAU brought critical technical expertise and practical guidance to the training, reinforcing our shared goal of advancing water-efficient and resilient farming practices in Punjab.</p>
pa: <p>ਟਿਕਾਊ ਚੌਲ ਖੇਤੀ ਨੂੰ ਉਤਸ਼ਾਹਿਤ ਕਰਨ ਦੇ ਸਾਡੇ ਲਗਾਤਾਰ ਯਤਨਾਂ ਦੇ ਹਿੱਸੇ ਵਜੋਂ, ਅਸੀਂ ਪੰਜਾਬ ਵਿੱਚ ਕਿਸਾਨਾਂ ਲਈ ਡਾਇਰੈਕਟ ਸੀਡਿਡ ਚੌਲ (DSR) ਵਰਕਸ਼ਾਪ ਆਯੋਜਿਤ ਕੀਤੀ। ਵਰਕਸ਼ਾਪ ਵਿੱਚ ਕਿਸਾਨਾਂ ਨੂੰ DSR ਤਰੀਕੇ, ਮੁੱਖ ਤਕਨੀਕਾਂ ਅਤੇ ਸਫਲ ਲਾਗੂ ਕਰਨ ਲਈ ਵਧੀਆ ਤਰੀਕਿਆਂ ਬਾਰੇ ਜਾਣੂ ਕਰਵਾਇਆ ਗਿਆ। DSR ਰਵਾਇਤੀ ਟ੍ਰਾਂਸਪਲਾਂਟਿੰਗ ਤਰੀਕਿਆਂ ਨਾਲੋਂ ਵੱਡਾ ਫਾਇਦਾ ਦਿੰਦਾ ਹੈ, ਕਿਉਂਕਿ ਇਹ ਪਾਣੀ ਅਤੇ ਮਜ਼ਦੂਰੀ—ਪੰਜਾਬ ਦੀ ਖੇਤੀਬਾੜੀ ਵਿੱਚ ਦੋ ਮਹੱਤਵਪੂਰਨ ਸਰੋਤ—ਘੱਟ ਲੋੜਦੇ ਹਨ।</p> <p>ਹਾਲਾਂਕਿ, DSR ਦੀ ਸਫਲਤਾ ਠੀਕ ਤਰੀਕੇ ਨਾਲ ਲਾਗੂ ਕਰਨ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। DSR ਨਾਲ ਜੁੜੀ ਮੁੱਖ ਚੁਣੌਤੀ ਘਾਹ-ਨਿਯੰਤਰਣ ਦੀ ਹੈ, ਜੇਕਰ ਧਿਆਨ ਨਾ ਦਿੱਤਾ ਜਾਵੇ ਤਾਂ ਘਾਹ ਵਧ ਸਕਦੇ ਹਨ। ਇਸ ਸਮੱਸਿਆ ਨੂੰ ਹੱਲ ਕਰਨ ਲਈ, ਸਾਡੀਆਂ ਟ੍ਰੇਨਿੰਗ ਸੈਸ਼ਨਾਂ ਵਿੱਚ ਘਾਹ-ਨਿਯੰਤਰਣ ਦੀਆਂ ਰਣਨੀਤੀਆਂ ਅਤੇ ਸਮੇਂ-ਸਿਰ ਖੇਤੀਬਾੜੀ ਤਰੀਕਿਆਂ 'ਤੇ ਜ਼ੋਰ ਦਿੱਤਾ ਗਿਆ, ਤਾਂ ਜੋ DSR ਦੀ ਪ੍ਰਭਾਵਸ਼ੀਲਤਾ ਅਤੇ ਲੰਬੇ ਸਮੇਂ ਦੇ ਫਾਇਦੇ ਯਕੀਨੀ ਬਣ ਸਕਣ।</p> <p>ਇਹ ਵਰਕਸ਼ਾਪ ਪੰਜਾਬ ਖੇਤੀਬਾੜੀ ਯੂਨੀਵਰਸਿਟੀ (PAU) ਨਾਲ ਸਾਂਝੇ ਤੌਰ 'ਤੇ ਕਰਵਾਈ ਗਈ, ਜੋ ਕਿ ਇਸ ਪ੍ਰੋਜੈਕਟ ਵਿੱਚ ਸਾਡਾ ਮੁੱਖ ਭਾਗੀਦਾਰ ਹੈ। ਖੇਤਰ ਦੀ ਮੁੱਖ ਚੌਲ ਖੋਜ ਸੰਸਥਾ ਹੋਣ ਦੇ ਨਾਤੇ, PAU ਨੇ ਟ੍ਰੇਨਿੰਗ ਲਈ ਮਹੱਤਵਪੂਰਨ ਤਕਨੀਕੀ ਗਿਆਨ ਅਤੇ ਵਿਹਾਰਕ ਮਾਰਗਦਰਸ਼ਨ ਦਿੱਤਾ, ਜਿਸ ਨਾਲ ਪੰਜਾਬ ਵਿੱਚ ਪਾਣੀ-ਸਮਝਦਾਰ ਅਤੇ ਮੌਸਮ-ਸਹਿਣਸ਼ੀਲ ਖੇਤੀ ਤਰੀਕਿਆਂ ਨੂੰ ਉਤਸ਼ਾਹਿਤ ਕਰਨ ਦੇ ਸਾਡੇ ਸਾਂਝੇ ਲਕੜ ਨੂੰ ਮਜ਼ਬੂਤੀ ਮਿਲੀ।</p>

source: Comprehensive Farmer Training
pa: ਵਿਸਤ੍ਰਿਤ ਕਿਸਾਨ ਟ੍ਰੇਨਿੰਗ

source: Holistic agricultural education program combining traditional farming wisdom with cutting-edge technology and sustainable practices for 500+ farmers across Patiala District
pa: ਪਟਿਆਲਾ ਜ਼ਿਲ੍ਹੇ ਦੇ 500+ ਕਿਸਾਨਾਂ ਲਈ ਰਵਾਇਤੀ ਖੇਤੀ ਗਿਆਨ, ਆਧੁਨਿਕ ਤਕਨੀਕ ਅਤੇ ਟਿਕਾਊ ਤਰੀਕਿਆਂ ਨੂੰ ਮਿਲਾ ਕੇ ਪੂਰਨ ਖੇਤੀਬਾੜੀ ਸਿੱਖਿਆ ਪ੍ਰੋਗਰਾਮ

source: Empowering Agricultural Communities
pa: ਖੇਤੀਬਾੜੀ ਭਾਈਚਾਰੇ ਨੂੰ ਸਸ਼ਕਤ ਕਰਨਾ

source: Our comprehensive farmer training program extends far beyond traditional agricultural education, creating a transformative learning ecosystem that bridges the gap between time-tested farming wisdom and modern agricultural innovation. We work directly with over 500 farmers across Patiala District, providing personalized support and cutting-edge training.
pa: ਸਾਡਾ ਵਿਸਤ੍ਰਿਤ ਕਿਸਾਨ ਟ੍ਰੇਨਿੰਗ ਪ੍ਰੋਗਰਾਮ ਰਵਾਇਤੀ ਖੇਤੀ ਸਿੱਖਿਆ ਤੋਂ ਕਾਫੀ ਅੱਗੇ ਹੈ, ਜੋ ਕਿ ਸਮੇਂ-ਪਰਖੇ ਗਿਆਨ ਅਤੇ ਆਧੁਨਿਕ ਨਵੀਨਤਾ ਵਿਚਕਾਰ ਪੂਲ ਬਣਾਉਂਦਾ ਹੈ। ਅਸੀਂ ਪਟਿਆਲਾ ਜ਼ਿਲ੍ਹੇ ਦੇ 500 ਤੋਂ ਵੱਧ ਕਿਸਾਨਾਂ ਨਾਲ ਸਿੱਧਾ ਕੰਮ ਕਰਦੇ ਹਾਂ, ਉਨ੍ਹਾਂ ਨੂੰ ਨਿੱਜੀ ਸਹਾਇਤਾ ਅਤੇ ਆਧੁਨਿਕ ਟ੍ਰੇਨਿੰਗ ਦਿੰਦੇ ਹਾਂ।

source: The program encompasses regular farm visits, detailed data collection on farming practices and irrigation behavior, groundwater monitoring, and innovative incentive-based programs that promote sustainable water use while supporting farmers economically. Each participating farm is precisely geo-mapped, enabling integration with remote sensing technology and hydrological models.
pa: ਇਹ ਪ੍ਰੋਗਰਾਮ ਨਿਯਮਤ ਖੇਤ ਦੌਰੇ, ਖੇਤੀ ਤਰੀਕਿਆਂ ਅਤੇ ਸਿੰਚਾਈ ਵਿਹਾਰ ਬਾਰੇ ਵਿਸਥਾਰਕ ਡੇਟਾ ਇਕੱਤਰਤਾ, ਭੂਜਲ ਨਿਗਰਾਨੀ, ਅਤੇ ਨਵੀਨਤਮ ਪ੍ਰੋਤਸਾਹਨ-ਅਧਾਰਤ ਪ੍ਰੋਗਰਾਮਾਂ ਨੂੰ ਸ਼ਾਮਲ ਕਰਦਾ ਹੈ, ਜੋ ਪਾਣੀ ਦੀ ਟਿਕਾਊ ਵਰਤੋਂ ਨੂੰ ਉਤਸ਼ਾਹਿਤ ਕਰਦੇ ਹਨ ਅਤੇ ਕਿਸਾਨਾਂ ਨੂੰ ਆਰਥਿਕ ਤੌਰ 'ਤੇ ਸਹਿਯੋਗ ਦਿੰਦੇ ਹਨ। ਹਰ ਭਾਗੀਦਾਰ ਖੇਤ ਨੂੰ ਠੀਕ-ਠੀਕ ਜਿਓ-ਮੈਪ ਕੀਤਾ ਜਾਂਦਾ ਹੈ, ਜਿਸ ਨਾਲ ਰਿਮੋਟ ਸੈਂਸਿੰਗ ਤਕਨੀਕ ਅਤੇ ਹਾਈਡ੍ਰੋਲੋਜੀ ਮਾਡਲਾਂ ਨਾਲ ਇਕਾਈਕਰਨ ਸੰਭਵ ਹੁੰਦਾ ਹੈ।

source: Through this holistic approach, we combine rigorous scientific measurement with farmer-centered design, ensuring both robust data collection and meaningful participation that leads to improved livelihoods, increased income, and enhanced food security.
pa: ਇਸ ਪੂਰਨ ਪਹੁੰਚ ਰਾਹੀਂ ਅਸੀਂ ਵਿਗਿਆਨਕ ਮਾਪ ਅਤੇ ਕਿਸਾਨ-ਕੇਂਦਰਤ ਡਿਜ਼ਾਈਨ ਨੂੰ ਮਿਲਾ ਕੇ, ਮਜ਼ਬੂਤ ਡੇਟਾ ਇਕੱਤਰਤਾ ਅਤੇ ਅਰਥਪੂਰਨ ਭਾਗੀਦਾਰੀ ਯਕੀਨੀ ਬਣਾਉਂਦੇ ਹਾਂ, ਜਿਸ ਨਾਲ ਜੀਵਨ-ਜੀਵਿਕਾ ਸੁਧਾਰ, ਆਮਦਨ ਵਾਧੂ ਅਤੇ ਖਾਦ ਸੁਰੱਖਿਆ ਵਧਦੀ ਹੈ।

source: Farmer Survey Analysis
pa: ਕਿਸਾਨ ਸਰਵੇਖਣ ਵਿਸ਼ਲੇਸ਼ਣ

source: Comprehensive survey analysis tools for gathering and processing farmer feedback, crop performance, and field conditions with advanced statistical modeling.
pa: ਕਿਸਾਨਾਂ ਦੀ ਪ੍ਰਤਿਕ੍ਰਿਆ, ਫਸਲ ਦੇ ਨਤੀਜੇ ਅਤੇ ਖੇਤ ਦੀ ਹਾਲਤ ਇਕੱਤਰ ਕਰਨ ਅਤੇ ਵਿਸ਼ਲੇਸ਼ਣ ਲਈ ਉੱਨਤ ਅੰਕੜਾ ਮਾਡਲਿੰਗ ਸਹਿਤ ਵਿਸਤ੍ਰਿਤ ਸਰਵੇਖਣ ਸੰਦ।

source: Coming Soon: Smart Survey Analytics
pa: ਜਲਦੀ ਆ ਰਿਹਾ: ਸਮਾਰਟ ਸਰਵੇਖਣ ਵਿਸ਼ਲੇਸ਼ਣ

source: Agriculture Knowledge Quiz
pa: ਖੇਤੀ ਗਿਆਨ ਪ੍ਰਸ਼ਨੋਤਰੀ

source: Test your farming knowledge while we develop the survey tool!
pa: ਸਰਵੇਖਣ ਸੰਦ ਬਣਾਉਂਦੇ ਹੋਏ ਆਪਣਾ ਖੇਤੀ ਗਿਆਨ ਪਰਖੋ!

source: Question
pa: ਸਵਾਲ

source: Score
pa: ਅੰਕ

source: Accuracy
pa: ਸਹੀਤਾ

source: Next Question
pa: ਅਗਲਾ ਸਵਾਲ

source: New Quiz
pa: ਨਵੀਂ ਪ੍ਰਸ਼ਨੋਤਰੀ

source: DIGI-VI Farmer Survey Analysis • Development Preview
pa: ਡਿਜੀ-ਵੀ ਕਿਸਾਨ ਸਰਵੇਖਣ ਵਿਸ਼ਲੇਸ਼ਣ • ਵਿਕਾਸ ਝਲਕ

source: What is the primary benefit of crop rotation?
pa: ਫਸਲ ਚੱਕਰ ਦਾ ਮੁੱਖ ਫਾਇਦਾ ਕੀ ਹੈ?

source: Increases soil fertility and breaks pest cycles
pa: ਮਿੱਟੀ ਦੀ ਉਪਜਾਊਤਾ ਵਧਾਉਂਦਾ ਹੈ ਅਤੇ ਕੀੜਿਆਂ ਦੇ ਚੱਕਰ ਨੂੰ ਤੋੜਦਾ ਹੈ

source: Reduces water consumption
pa: ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਘਟਾਉਂਦਾ ਹੈ

source: Increases farm size
pa: ਖੇਤ ਦਾ ਆਕਾਰ ਵਧਾਉਂਦਾ ਹੈ

source: Improves weather conditions
pa: ਮੌਸਮ ਦੀਆਂ ਹਾਲਤਾਂ ਸੁਧਾਰਦਾ ਹੈ

source: Which nutrient deficiency causes yellowing of leaves (chlorosis)?
pa: ਕਿਹੜੀ ਪੌਸ਼ਟਿਕ ਘਾਟ ਪੱਤਿਆਂ ਦੇ ਪੀਲੇ ਹੋਣ (ਕਲੋਰੋਸਿਸ) ਦਾ ਕਾਰਨ ਬਣਦੀ ਹੈ?

source: Phosphorus
pa: ਫਾਸਫੋਰਸ

source: Potassium
pa: ਪੋਟਾਸਿਅਮ

source: Nitrogen
pa: ਨਾਈਟ੍ਰੋਜਨ

source: Calcium
pa: ਕੈਲਸ਼ੀਅਮ

source: What does pH measure in soil?
pa: ਮਿੱਟੀ ਵਿੱਚ pH ਕੀ ਮਾਪਦਾ ਹੈ?

source: Nutrient content
pa: ਪੌਸ਼ਟਿਕ ਤੱਤ

source: Acidity or alkalinity
pa: ਅਮਲਤਾ ਜਾਂ ਖਾਰਾਪਨ

source: Organic matter
pa: ਜੈਵਿਕ ਪਦਾਰਥ

source: Which irrigation method is most water-efficient?
pa: ਕਿਹੜਾ ਸਿੰਚਾਈ ਤਰੀਕਾ ਸਭ ਤੋਂ ਵੱਧ ਪਾਣੀ-ਬਚਾਉਂਦਾ ਹੈ?

source: What is the ideal soil pH range for most crops?
pa: ਜ਼ਿਆਦਾਤਰ ਫਸਲਾਂ ਲਈ ਮਿੱਟੀ ਦਾ ਆਦਰਸ਼ pH ਰੇਂਜ ਕੀ ਹੈ?

source: Which farming practice helps prevent soil erosion?
pa: ਕਿਹੜਾ ਖੇਤੀ ਤਰੀਕਾ ਮਿੱਟੀ ਦੀ ਕਟਾਈ ਰੋਕਣ ਵਿੱਚ ਮਦਦ ਕਰਦਾ ਹੈ?

source: Deep tillage
pa: ਗਹਿਰੀ ਜੋਤਾਈ

source: Contour farming
pa: ਕਨਟੂਰ ਖੇਤੀ

source: Monoculture
pa: ਇੱਕੋ ਫਸਲ ਖੇਤੀ

source: Excessive grazing
pa: ਵੱਧ ਚਰਾਈ

source: What is the main purpose of adding organic matter to soil?
pa: ਮਿੱਟੀ ਵਿੱਚ ਜੈਵਿਕ ਪਦਾਰਥ ਪਾਉਣ ਦਾ ਮੁੱਖ ਉਦੇਸ਼ ਕੀ ਹੈ?

source: Increase soil temperature
pa: ਮਿੱਟੀ ਦਾ ਤਾਪਮਾਨ ਵਧਾਉਣਾ

source: Improve soil structure and fertility
pa: ਮਿੱਟੀ ਦੀ ਬਣਤਰ ਅਤੇ ਉਪਜਾਊਤਾ ਸੁਧਾਰਨਾ

source: Reduce soil pH
pa: ਮਿੱਟੀ ਦਾ pH ਘਟਾਉਣਾ

source: Prevent plant growth
pa: ਪੌਦਿਆਂ ਦੀ ਵਾਧੂ ਨੂੰ ਰੋਕਣਾ

source: Which pest management approach is most sustainable?
pa: ਕਿਹੜਾ ਕੀੜੇ ਪ੍ਰਬੰਧਨ ਤਰੀਕਾ ਸਭ ਤੋਂ ਟਿਕਾਊ ਹੈ?

source: Heavy pesticide use
pa: ਵੱਧ ਕੀਟਨਾਸ਼ਕ ਵਰਤਣਾ

source: Integrated Pest Management (IPM)
pa: ਇੰਟੀਗ੍ਰੇਟਡ ਪੈਸਟ ਮੈਨੇਜਮੈਂਟ (IPM)
